/* automatically generated by rust-bindgen 0.69.4 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const sdc_cfg_type_SDC_CFG_TYPE_SCAN_BUFFER_CFG: sdc_cfg_type = 5;
#[doc = " See @ref sdc_cfg_t::adv_buffer_cfg."]
pub const sdc_cfg_type_SDC_CFG_TYPE_ADV_BUFFER_CFG: sdc_cfg_type = 6;
#[doc = " See @ref sdc_cfg_t::fal_size"]
pub const sdc_cfg_type_SDC_CFG_TYPE_FAL_SIZE: sdc_cfg_type = 7;
#[doc = " See @ref sdc_cfg_t::periodic_adv_count."]
pub const sdc_cfg_type_SDC_CFG_TYPE_PERIODIC_ADV_COUNT: sdc_cfg_type = 8;
#[doc = " See @ref sdc_cfg_t::periodic_sync_count."]
pub const sdc_cfg_type_SDC_CFG_TYPE_PERIODIC_SYNC_COUNT: sdc_cfg_type = 9;
#[doc = " See @ref sdc_cfg_t::periodic_sync_buffer_cfg."]
pub const sdc_cfg_type_SDC_CFG_TYPE_PERIODIC_SYNC_BUFFER_CFG: sdc_cfg_type = 10;
#[doc = " See @ref sdc_cfg_t::periodic_adv_list_size."]
pub const sdc_cfg_type_SDC_CFG_TYPE_PERIODIC_ADV_LIST_SIZE: sdc_cfg_type = 11;
#[doc = " See @ref sdc_cfg_t::periodic_adv_rsp_count."]
pub const sdc_cfg_type_SDC_CFG_TYPE_PERIODIC_ADV_RSP_COUNT: sdc_cfg_type = 12;
#[doc = " See @ref sdc_cfg_t::periodic_adv_rsp_buffer_cfg."]
pub const sdc_cfg_type_SDC_CFG_TYPE_PERIODIC_ADV_RSP_BUFFER_CFG: sdc_cfg_type = 13;
#[doc = " See @ref sdc_cfg_t::periodic_adv_rsp_failure_reporting_cfg."]
pub const sdc_cfg_type_SDC_CFG_TYPE_PERIODIC_ADV_RSP_FAILURE_REPORTING_CFG: sdc_cfg_type = 14;
#[doc = " See @ref sdc_cfg_t::periodic_sync_rsp_tx_buffer_cfg."]
pub const sdc_cfg_type_SDC_CFG_TYPE_PERIODIC_SYNC_RSP_TX_BUFFER_CFG: sdc_cfg_type = 15;
#[doc = " See @ref sdc_cfg_t::cig_count."]
pub const sdc_cfg_type_SDC_CFG_TYPE_CIG_COUNT: sdc_cfg_type = 16;
#[doc = " See @ref sdc_cfg_t::cis_count."]
pub const sdc_cfg_type_SDC_CFG_TYPE_CIS_COUNT: sdc_cfg_type = 17;
#[doc = " See @ref sdc_cfg_t::big_count."]
pub const sdc_cfg_type_SDC_CFG_TYPE_BIG_COUNT: sdc_cfg_type = 18;
#[doc = " See @ref sdc_cfg_t::bis_sink_count."]
pub const sdc_cfg_type_SDC_CFG_TYPE_BIS_SINK_COUNT: sdc_cfg_type = 19;
#[doc = " See @ref sdc_cfg_t::bis_source_count."]
pub const sdc_cfg_type_SDC_CFG_TYPE_BIS_SOURCE_COUNT: sdc_cfg_type = 20;
#[doc = " See @ref sdc_cfg_t::iso_rx_pdu_buffer_per_stream_cfg."]
pub const sdc_cfg_type_SDC_CFG_TYPE_ISO_RX_PDU_BUFFER_PER_STREAM_CFG: sdc_cfg_type = 21;
#[doc = " See @ref sdc_cfg_t::iso_rx_sdu_buffer_cfg."]
pub const sdc_cfg_type_SDC_CFG_TYPE_ISO_RX_SDU_BUFFER_CFG: sdc_cfg_type = 22;
#[doc = " See @ref sdc_cfg_t::iso_tx_buffer_cfg."]
pub const sdc_cfg_type_SDC_CFG_TYPE_ISO_TX_BUFFER_CFG: sdc_cfg_type = 23;
#[doc = " See @ref sdc_cfg_t::iso_buffer_cfg."]
pub const sdc_cfg_type_SDC_CFG_TYPE_ISO_BUFFER_CFG: sdc_cfg_type = 24;
pub type sdc_cfg_type = crate::ctypes::c_uint;
#[doc = "  Role count."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_cfg_role_count_t {
    #[doc = "< Max number of concurrent roles."]
    pub count: u8,
}
#[test]
fn bindgen_test_layout_sdc_cfg_role_count_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_cfg_role_count_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_cfg_role_count_t>(),
        1usize,
        concat!("Size of: ", stringify!(sdc_cfg_role_count_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_cfg_role_count_t>(),
        1usize,
        concat!("Alignment of ", stringify!(sdc_cfg_role_count_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_role_count_t),
            "::",
            stringify!(count)
        )
    );
}
#[doc = "  Buffer configuration."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_cfg_buffer_cfg_t {
    #[doc = "< Link Layer TX packet size. Valid range: 27-251.\nDefault: @ref SDC_DEFAULT_TX_PACKET_SIZE."]
    pub tx_packet_size: u8,
    #[doc = "< Link Layer RX packet size. Valid range: 27-251.\nDefault: @ref SDC_DEFAULT_RX_PACKET_SIZE."]
    pub rx_packet_size: u8,
    #[doc = "< Link Layer TX packet count per link. Minimum of 1.\nDefault: @ref SDC_DEFAULT_TX_PACKET_COUNT."]
    pub tx_packet_count: u8,
    #[doc = "< Link Layer RX packet count per link. Minimum of 1.\nDefault: @ref SDC_DEFAULT_RX_PACKET_COUNT."]
    pub rx_packet_count: u8,
}
#[test]
fn bindgen_test_layout_sdc_cfg_buffer_cfg_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_cfg_buffer_cfg_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_cfg_buffer_cfg_t>(),
        4usize,
        concat!("Size of: ", stringify!(sdc_cfg_buffer_cfg_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_cfg_buffer_cfg_t>(),
        1usize,
        concat!("Alignment of ", stringify!(sdc_cfg_buffer_cfg_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_buffer_cfg_t),
            "::",
            stringify!(tx_packet_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_size) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_buffer_cfg_t),
            "::",
            stringify!(rx_packet_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_count) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_buffer_cfg_t),
            "::",
            stringify!(tx_packet_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_count) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_buffer_cfg_t),
            "::",
            stringify!(rx_packet_count)
        )
    );
}
#[doc = "  Buffer count configuration."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_cfg_buffer_count_t {
    #[doc = "< Number of buffers."]
    pub count: u8,
}
#[test]
fn bindgen_test_layout_sdc_cfg_buffer_count_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_cfg_buffer_count_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_cfg_buffer_count_t>(),
        1usize,
        concat!("Size of: ", stringify!(sdc_cfg_buffer_count_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_cfg_buffer_count_t>(),
        1usize,
        concat!("Alignment of ", stringify!(sdc_cfg_buffer_count_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_buffer_count_t),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_cfg_adv_buffer_cfg_t {
    #[doc = " The maximum advertising data length that can be used by an advertiser\n\n If set to 31, the controller will support 31 bytes of advertising data and scan response data.\n Setting a value larger than 31 bytes is only useful when supporting extended advertising.\n\n Default: @ref SDC_DEFAULT_ADV_BUF_SIZE."]
    pub max_adv_data: u16,
}
#[test]
fn bindgen_test_layout_sdc_cfg_adv_buffer_cfg_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_cfg_adv_buffer_cfg_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_cfg_adv_buffer_cfg_t>(),
        2usize,
        concat!("Size of: ", stringify!(sdc_cfg_adv_buffer_cfg_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_cfg_adv_buffer_cfg_t>(),
        2usize,
        concat!("Alignment of ", stringify!(sdc_cfg_adv_buffer_cfg_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_adv_data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_adv_buffer_cfg_t),
            "::",
            stringify!(max_adv_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_cfg_periodic_adv_rsp_buffer_cfg_t {
    #[doc = " Configures the size of the buffer pool allocated to each periodic\n advertising set with responses for subevent data.\n\n Default: @ref SDC_DEFAULT_PERIODIC_ADV_RSP_TX_BUFFER_COUNT."]
    pub tx_buffer_count: u8,
    #[doc = " Configures the maximum amount of data which can be sent in a PAwR subevent.\n\n Default: @ref SDC_DEFAULT_PERIODIC_ADV_RSP_MAX_TX_DATA."]
    pub max_tx_data_size: u8,
    #[doc = " Configures the size of the buffer pool allocated to each periodic\n advertising set with responses for response reports.\n\n The value can be set to 0 to disable listening for responses.\n\n Default: @ref SDC_DEFAULT_PERIODIC_ADV_RSP_RX_BUFFER_COUNT."]
    pub rx_buffer_count: u8,
}
#[test]
fn bindgen_test_layout_sdc_cfg_periodic_adv_rsp_buffer_cfg_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_cfg_periodic_adv_rsp_buffer_cfg_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_cfg_periodic_adv_rsp_buffer_cfg_t>(),
        3usize,
        concat!("Size of: ", stringify!(sdc_cfg_periodic_adv_rsp_buffer_cfg_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_cfg_periodic_adv_rsp_buffer_cfg_t>(),
        1usize,
        concat!("Alignment of ", stringify!(sdc_cfg_periodic_adv_rsp_buffer_cfg_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_buffer_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_periodic_adv_rsp_buffer_cfg_t),
            "::",
            stringify!(tx_buffer_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_tx_data_size) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_periodic_adv_rsp_buffer_cfg_t),
            "::",
            stringify!(max_tx_data_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_buffer_count) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_periodic_adv_rsp_buffer_cfg_t),
            "::",
            stringify!(rx_buffer_count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_cfg_iso_tx_buffer_cfg_t {
    #[doc = " Configures the size of the shared HCI TX buffer pool allocated for ISO.\n\n Default: @ref SDC_DEFAULT_ISO_TX_HCI_BUFFER_COUNT."]
    pub tx_hci_buffer_count: u8,
    #[doc = " Configures the number of TX buffers allocated per ISO stream.\n\n @note For BIS, this value determines the maximum supported pretransmission offset.\n\n Default: @ref SDC_DEFAULT_ISO_TX_PDU_BUFFER_PER_STREAM_COUNT."]
    pub tx_pdu_buffer_per_stream_count: u8,
}
#[test]
fn bindgen_test_layout_sdc_cfg_iso_tx_buffer_cfg_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_cfg_iso_tx_buffer_cfg_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_cfg_iso_tx_buffer_cfg_t>(),
        2usize,
        concat!("Size of: ", stringify!(sdc_cfg_iso_tx_buffer_cfg_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_cfg_iso_tx_buffer_cfg_t>(),
        1usize,
        concat!("Alignment of ", stringify!(sdc_cfg_iso_tx_buffer_cfg_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_hci_buffer_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_iso_tx_buffer_cfg_t),
            "::",
            stringify!(tx_hci_buffer_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pdu_buffer_per_stream_count) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_iso_tx_buffer_cfg_t),
            "::",
            stringify!(tx_pdu_buffer_per_stream_count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_cfg_iso_buffer_cfg_t {
    #[doc = " Configures the number of shared HCI TX buffers allocated for ISO.\n\n Default: @ref SDC_DEFAULT_ISO_TX_HCI_BUFFER_COUNT."]
    pub tx_hci_buffer_count: u8,
    #[doc = " Configures the size of shared HCI TX buffers allocated for ISO.\n\n Default: @ref SDC_DEFAULT_ISO_TX_HCI_BUFFER_SIZE."]
    pub tx_hci_buffer_size: u16,
    #[doc = " Configures the number of TX PDU buffers allocated per ISO stream.\n\n This is the number of maximum size (251 bytes) PDU buffers. When PDU size is smaller\n than the maximum size, the pool will be repartitioned into a larger number of adjusted PDUs.\n\n For BIS, this value is used to determine the furthest PDU that can be stored in the buffers.\n Therefore, limiting the number of pretransmission subevents and maximum pretransmission offset (PTO)\n that the controller can use.\n\n Default: @ref SDC_DEFAULT_ISO_TX_PDU_BUFFER_PER_STREAM_COUNT."]
    pub tx_pdu_buffer_per_stream_count: u8,
    #[doc = " Configures the number of RX PDU buffers allocated per ISO stream.\n\n This is the number of maximum size (251 bytes) PDU buffers. When PDU size is smaller\n than the maximum size, the pool will be repartitioned into a larger number of adjusted PDUs.\n\n For BIS, this value determines how many pretransmissions can be stored and utilized.\n\n Default: @ref SDC_DEFAULT_ISO_RX_PDU_BUFFER_PER_STREAM_COUNT."]
    pub rx_pdu_buffer_per_stream_count: u8,
    #[doc = " Configures the number of RX SDU buffers allocated for ISO.\n\n Default: @ref SDC_DEFAULT_ISO_RX_SDU_BUFFER_COUNT."]
    pub rx_sdu_buffer_count: u8,
    #[doc = " Configures the size of RX SDU buffers allocated for ISO.\n\n Default: @ref SDC_DEFAULT_ISO_RX_SDU_BUFFER_SIZE."]
    pub rx_sdu_buffer_size: u16,
}
#[test]
fn bindgen_test_layout_sdc_cfg_iso_buffer_cfg_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_cfg_iso_buffer_cfg_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_cfg_iso_buffer_cfg_t>(),
        10usize,
        concat!("Size of: ", stringify!(sdc_cfg_iso_buffer_cfg_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_cfg_iso_buffer_cfg_t>(),
        2usize,
        concat!("Alignment of ", stringify!(sdc_cfg_iso_buffer_cfg_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_hci_buffer_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_iso_buffer_cfg_t),
            "::",
            stringify!(tx_hci_buffer_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_hci_buffer_size) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_iso_buffer_cfg_t),
            "::",
            stringify!(tx_hci_buffer_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pdu_buffer_per_stream_count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_iso_buffer_cfg_t),
            "::",
            stringify!(tx_pdu_buffer_per_stream_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_pdu_buffer_per_stream_count) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_iso_buffer_cfg_t),
            "::",
            stringify!(rx_pdu_buffer_per_stream_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_sdu_buffer_count) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_iso_buffer_cfg_t),
            "::",
            stringify!(rx_sdu_buffer_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_sdu_buffer_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_iso_buffer_cfg_t),
            "::",
            stringify!(rx_sdu_buffer_size)
        )
    );
}
#[doc = "  SoftDevice Controller configuration."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union sdc_cfg_t {
    #[doc = " Max number of concurrent central connections.\n  Default: @ref SDC_DEFAULT_CENTRAL_COUNT."]
    pub central_count: sdc_cfg_role_count_t,
    #[doc = " Max number of concurrent peripheral connections.\n  Default: @ref SDC_DEFAULT_PERIPHERAL_COUNT."]
    pub peripheral_count: sdc_cfg_role_count_t,
    #[doc = " Configures the number and size of the data buffers available per link.\n  Default: See @ref sdc_cfg_buffer_cfg_t."]
    pub buffer_cfg: sdc_cfg_buffer_cfg_t,
    #[doc = " Max number of concurrent advertisers.\n  Must be more than or equal to @ref sdc_cfg_t::periodic_adv_count.\n  Default: @ref SDC_DEFAULT_ADV_COUNT."]
    pub adv_count: sdc_cfg_role_count_t,
    #[doc = " Configures the maximum number of advertising reports available in the scanner.\n\n  The minimum allowed number of buffers is 2.\n\n  It is recommended to support at least three buffers,\n  otherwise the scan response report will likely not be generated.\n\n  Default: @ref SDC_DEFAULT_SCAN_BUFFER_COUNT."]
    pub scan_buffer_cfg: sdc_cfg_buffer_count_t,
    #[doc = " Configures the maximum advertising data per advertising set.\n  Default: See @ref sdc_cfg_adv_buffer_cfg_t."]
    pub adv_buffer_cfg: sdc_cfg_adv_buffer_cfg_t,
    #[doc = " Configures the maximum size of the Filter Accept List.\n\n Default: @ref SDC_DEFAULT_FAL_SIZE."]
    pub fal_size: u16,
    #[doc = " Configures the maximum number of concurrent periodic advertisers.\n  Must be less than or equal to @ref sdc_cfg_t::adv_count.\n  Default: @ref SDC_DEFAULT_PERIODIC_ADV_COUNT."]
    pub periodic_adv_count: sdc_cfg_role_count_t,
    #[doc = " Configures the maximum number of concurrent synchronizations\n  to periodic advertisers.\n  Default: @ref SDC_DEFAULT_PERIODIC_SYNC_COUNT."]
    pub periodic_sync_count: sdc_cfg_role_count_t,
    #[doc = " Configures the maximum number of periodic advertising reports available\n  for each synchronization to a periodic advertiser.\n\n  Each synchronization to a periodic advertiser allocates its own buffer\n  pool.\n\n  When periodic sync with responses is not supported,\n  the minimum allowed number of buffers is 2.\n\n  When periodic sync with responses is supported,\n  the minimum allowed number of buffers is 1.\n\n  No reports for a new advertising event containing chained PDUs will be\n  enqueued until the host has emptied the previous event's buffers.\n\n  Default: @ref SDC_DEFAULT_PERIODIC_SYNC_BUFFER_COUNT."]
    pub periodic_sync_buffer_cfg: sdc_cfg_buffer_count_t,
    #[doc = " Configures the size of the periodic advertiser list.\n\n The maximum number of supported devices is 8.\n\n Default: @ref SDC_DEFAULT_PERIODIC_ADV_LIST_SIZE."]
    pub periodic_adv_list_size: u8,
    #[doc = " Configures the maximum number of concurrent periodic advertising sets with responses.\n\n Default: @ref SDC_DEFAULT_PERIODIC_ADV_RSP_COUNT."]
    pub periodic_adv_rsp_count: sdc_cfg_role_count_t,
    #[doc = " Configures the number and size of the data buffers available per periodic advertising set with responses.\n  Default: See @ref sdc_cfg_periodic_adv_rsp_buffer_cfg_t."]
    pub periodic_adv_rsp_buffer_cfg: sdc_cfg_periodic_adv_rsp_buffer_cfg_t,
    #[doc = " Enables/disables failure response reports for Periodic Advertising with Responses - Advertiser.\n\n Set to 1 to enable RX failure reporting, 0 to disable.\n\n Default: disabled."]
    pub periodic_adv_rsp_failure_reporting_cfg: u8,
    #[doc = " Configures the maximum number of responses that can be stored in the controller\n  when synchronized to a periodic advertiser with responses.\n\n The minimum number of buffers is 1.\n\n Default: @ref SDC_DEFAULT_PERIODIC_SYNC_RSP_TX_BUFFER_COUNT."]
    pub periodic_sync_rsp_tx_buffer_cfg: sdc_cfg_buffer_count_t,
    #[doc = " Configures the maximum number of concurrent CIGs.\n\n Default: @ref SDC_DEFAULT_CIG_COUNT."]
    pub cig_count: sdc_cfg_role_count_t,
    #[doc = " Configures the maximum number of concurrent CISs.\n\n Default: @ref SDC_DEFAULT_CIS_COUNT."]
    pub cis_count: sdc_cfg_role_count_t,
    #[doc = " Configures the maximum number of concurrent BIGs.\n\n Default: @ref SDC_DEFAULT_BIG_COUNT."]
    pub big_count: sdc_cfg_role_count_t,
    #[doc = " Configures the maximum number of concurrent sink BISs.\n\n Default: @ref SDC_DEFAULT_BIS_SINK_COUNT."]
    pub bis_sink_count: sdc_cfg_role_count_t,
    #[doc = " Configures the maximum number of concurrent source BISs.\n\n Default: @ref SDC_DEFAULT_BIS_SOURCE_COUNT."]
    pub bis_source_count: sdc_cfg_role_count_t,
    #[doc = " Configures the size of the per stream RX PDU buffer pool allocated for ISO streams.\n\n Default: @ref SDC_DEFAULT_ISO_RX_PDU_BUFFER_PER_STREAM_COUNT."]
    pub iso_rx_pdu_buffer_per_stream_cfg: sdc_cfg_buffer_count_t,
    #[doc = " Configures the RX SDU buffer count allocated for ISO.\n\n Default: @ref SDC_DEFAULT_ISO_RX_SDU_BUFFER_COUNT."]
    pub iso_rx_sdu_buffer_cfg: sdc_cfg_buffer_count_t,
    #[doc = " Configures the size and number of TX buffer pools allocated for ISO.\n\n Default: See @ref sdc_cfg_iso_tx_buffer_cfg_t."]
    pub iso_tx_buffer_cfg: sdc_cfg_iso_tx_buffer_cfg_t,
    #[doc = " Configures the number and size of buffers allocated for ISO.\n\n Default: See @ref sdc_cfg_iso_buffer_cfg_t."]
    pub iso_buffer_cfg: sdc_cfg_iso_buffer_cfg_t,
}
#[test]
fn bindgen_test_layout_sdc_cfg_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_cfg_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_cfg_t>(),
        10usize,
        concat!("Size of: ", stringify!(sdc_cfg_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_cfg_t>(),
        2usize,
        concat!("Alignment of ", stringify!(sdc_cfg_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).central_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(central_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).peripheral_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(peripheral_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buffer_cfg) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sdc_cfg_t), "::", stringify!(buffer_cfg))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).adv_count) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sdc_cfg_t), "::", stringify!(adv_count))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_buffer_cfg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(scan_buffer_cfg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).adv_buffer_cfg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(adv_buffer_cfg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fal_size) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sdc_cfg_t), "::", stringify!(fal_size))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).periodic_adv_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(periodic_adv_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).periodic_sync_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(periodic_sync_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).periodic_sync_buffer_cfg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(periodic_sync_buffer_cfg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).periodic_adv_list_size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(periodic_adv_list_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).periodic_adv_rsp_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(periodic_adv_rsp_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).periodic_adv_rsp_buffer_cfg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(periodic_adv_rsp_buffer_cfg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).periodic_adv_rsp_failure_reporting_cfg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(periodic_adv_rsp_failure_reporting_cfg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).periodic_sync_rsp_tx_buffer_cfg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(periodic_sync_rsp_tx_buffer_cfg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cig_count) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sdc_cfg_t), "::", stringify!(cig_count))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cis_count) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sdc_cfg_t), "::", stringify!(cis_count))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).big_count) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sdc_cfg_t), "::", stringify!(big_count))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bis_sink_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(bis_sink_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bis_source_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(bis_source_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iso_rx_pdu_buffer_per_stream_cfg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(iso_rx_pdu_buffer_per_stream_cfg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iso_rx_sdu_buffer_cfg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(iso_rx_sdu_buffer_cfg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iso_tx_buffer_cfg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(iso_tx_buffer_cfg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iso_buffer_cfg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_cfg_t),
            "::",
            stringify!(iso_buffer_cfg)
        )
    );
}
extern "C" {
    #[doc = "  Initialize the SoftDevice Controller\n\n After this function is called, the application may use SoC APIs.\n\n * `fault_handler` - The fault handler will be executed when there is an\n                            internal error in the SoftDevice Controller.\n\n Returns 0            Success\n Returns -NRF_EINVAL  Invalid argument provided\n Returns -NRF_EPERM   Unable to initialize because\n                        - MPSL is not initialized\n                        - MPSL needs to be configured with a LFCLK accuracy\n                          of 500 ppm or better."]
    pub fn sdc_init(fault_handler: sdc_fault_handler_t) -> i32;
}
extern "C" {
    #[doc = "  Change or add a SoftDevice Controller configuration\n\n To change the default configuration, update @ref\n SDC_DEFAULT_RESOURCE_CFG_TAG. To create or update a new\n configuration, provide another resource_cfg_tag.\n\n @note The application can set config_type to @ref\n       SDC_CFG_TYPE_NONE to obtain the required memory size for the\n       current configuration in bytes.\n\n @note Resource configuration can only be performed prior to calling @ref\n       sdc_enable(). However, the current configuration may be\n       changed after enabling the SoftDevice Controller.\n\n * `config_tag` - Configuration tag.\n * `config_type` - Configuration type. See also @ref sdc_cfg_type.\n * `p_resource_cfg` - Configuration to be changed.\n\n @returns Required memory size for the current configuration in bytes.\n Returns -NRF_EOPNOTSUPP    Unsupported configuration.\n Returns -NRF_ENOMEM        Configuration required over 64 kB of RAM that is\nnot supported currently.\n Returns -NRF_EINVAL        Invalid argument provided.\n Returns -NRF_EPERM         This API was called after @ref sdc_enable()."]
    pub fn sdc_cfg_set(config_tag: u8, config_type: u8, p_resource_cfg: *const sdc_cfg_t) -> i32;
}
extern "C" {
    #[doc = "  Enable the SoftDevice Controller\n\n After this function is called, the application may utilize HCI APIs.\n\n * `callback` - The callback will be executed when HCI data or and HCI\n                      event is available. The callback will be executed in\n                      the same context as @ref mpsl_low_priority_process.\n                      See also @ref sdc_hci_get().\n * `p_mem` - Provide memory for the current resource configuration.\n                      To obtain the required memory size, use the value\n                      returned from @ref sdc_cfg_set().\n                      The pointer must be 8 bytes aligned.\n\n Returns 0            Success\n Returns -NRF_EINVAL  Invalid argument provided\n Returns -NRF_EPERM   The entropy source is not configured. Call @ref sdc_rand_source_register() first."]
    pub fn sdc_enable(callback: sdc_callback_t, p_mem: *mut u8) -> i32;
}
extern "C" {
    #[doc = "  Disable the SoftDevice Controller\n\n This call is synchronous. After the SoftDevice Controller is disabled, Bluetooth LE\n functionality is no longer available.\n\n Returns 0 Success"]
    pub fn sdc_disable() -> i32;
}
extern "C" {
    #[doc = "  Obtain build revision string\n\n The application must provide a buffer that is at least @ref SDC_BUILD_REVISION_SIZE\n bytes long. The SoftDevice Controller will copy the build revision string to the provided buffer.\n\n * `p_build_revision` - Build revision.\n\n Returns 0            Success\n Returns -NRF_EINVAL  Invalid argument provided"]
    pub fn sdc_build_revision_get(p_build_revision: *mut u8) -> i32;
}
extern "C" {
    #[doc = "  Support Advertising State\n\n After this API is called, the controller will support the HCI commands\n and events related to the Advertising State.\n Only non-connectable advertising is supported. To support connectable\n advertising, call @ref sdc_support_peripheral().\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  Advertising state is not supported."]
    pub fn sdc_support_adv() -> i32;
}
extern "C" {
    #[doc = "  Support extended advertising\n\n After this API is called, the controller will support the HCI commands\n and events related to both legacy and extended advertising.\n\n To reduce the size of the final linked image, the application should\n call either @ref sdc_support_adv() or @ref sdc_support_ext_adv().\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  Extended advertising state is not supported."]
    pub fn sdc_support_ext_adv() -> i32;
}
extern "C" {
    #[doc = "  Support Peripheral role\n\n After this API is called, the controller will support the HCI commands\n and events related to the peripheral role.\n\n The application shall call either @ref sdc_support_adv() or\n @ref sdc_support_ext_adv() to be able to support connection\n establishment.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  Peripheral role is not supported."]
    pub fn sdc_support_peripheral() -> i32;
}
extern "C" {
    #[doc = "  Support Scanning state\n\n After this API is called, the controller will support the HCI commands\n and events related to the scanning state.\n\n To reduce the size of the final linked image, the application should\n not call both @ref sdc_support_scan() and @ref sdc_support_ext_scan().\n\n This API shall not be called together with\n @ref sdc_support_central() or @ref sdc_support_ext_central().\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  Scanning state is not supported."]
    pub fn sdc_support_scan() -> i32;
}
extern "C" {
    #[doc = "  Support scanning for extended advertising PDUs\n\n After this API is called, the controller will support the HCI commands\n and events related to both legacy and extended scanning.\n\n To reduce the size of the final linked image, the application should\n not call both @ref sdc_support_scan() and @ref sdc_support_ext_scan().\n\n This API shall not be called together with\n @ref sdc_support_central() or @ref sdc_support_ext_central().\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  Extended scanning state is not supported."]
    pub fn sdc_support_ext_scan() -> i32;
}
extern "C" {
    #[doc = "  Support Scanner, Initiator, and Central role\n\n After this API is called, the controller will support the HCI commands\n and events related to the scanner, initiator, and central role.\n\n To reduce the size of the final linked image, the application should\n not call both @ref sdc_support_central() and @ref sdc_support_ext_central().\n\n This API shall not be called together with\n @ref sdc_support_scan() or @ref sdc_support_ext_scan().\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  These features are not supported."]
    pub fn sdc_support_central() -> i32;
}
extern "C" {
    #[doc = "  Support Extended Scanner, Extended Initiator, and Central role\n\n After this API is called, the controller will support the HCI commands\n and events related to the extended scanner, initiator, and central role.\n\n To reduce the size of the final linked image, the application should\n not call both @ref sdc_support_central() and @ref sdc_support_ext_central().\n\n This API shall not be called together with\n @ref sdc_support_scan() or @ref sdc_support_ext_scan().\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  These features are not supported."]
    pub fn sdc_support_ext_central() -> i32;
}
extern "C" {
    #[doc = "  Support Data Length Extensions for a central device\n\n After this API is called, the controller will support data length extension in the central role.\n That is:\n  - DLE is marked supported in the LL Feature Exchange procedure.\n  - All DLE HCI APIs are supported. The controller replies with LL_LENGTH_RSP\n    when a LL_LENGTH_REQ is received.\n\n @note The application is required to call both @ref sdc_support_dle_central() and @ref sdc_support_dle_peripheral()\n       if both central and peripheral roles are supported.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  Data Length Extension or Central Role is not supported."]
    pub fn sdc_support_dle_central() -> i32;
}
extern "C" {
    #[doc = "  Support Data Length Extensions for a peripheral device\n\n After this API is called, the controller will support data length extension in the peripheral role.\n That is:\n  - DLE is marked supported in the LL Feature Exchange procedure.\n  - All DLE HCI APIs are supported. The controller replies with LL_LENGTH_RSP\n    when a LL_LENGTH_REQ is received.\n\n @note The application is required to call both @ref sdc_support_dle_central() and @ref sdc_support_dle_peripheral()\n       if both central and peripheral roles are supported.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  Data Length Extension or Peripheral Role is not supported."]
    pub fn sdc_support_dle_peripheral() -> i32;
}
extern "C" {
    #[doc = "  Support LE 2M PHY\n\n After this API is called, the controller will support LE 2M PHY. That is:\n  - The controller can use 2M PHY in both the connected and non-connected state.\n  - LE 2M PHY is marked supported in the LL Feature Exchange procedure.\n\n @note The application is required to call @ref sdc_support_phy_update_central() and/or @ref sdc_support_phy_update_peripheral()\n       to enable the PHY update procedure.\n\n Returns 0           Success\n Returns -NRF_EPERM  This API must be called before @ref sdc_cfg_set() or @ref sdc_enable()."]
    pub fn sdc_support_le_2m_phy() -> i32;
}
extern "C" {
    #[doc = "  Support LE Coded PHY\n\n After this API is called, the controller will support LE Coded PHY. That is:\n  - The controller can use LE Coded PHY in both the connected and non-connected state.\n  - LE Coded PHY is marked supported in the LL Feature Exchange procedure.\n\n @note The application is required to call @ref sdc_support_phy_update_central() and/or @ref sdc_support_phy_update_peripheral()\n       to enable the PHY update procedure.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  LE Coded PHY is not supported."]
    pub fn sdc_support_le_coded_phy() -> i32;
}
extern "C" {
    #[doc = "  Support PHY Update Procedure for central role\n\n After this API is called, the controller will support PHY update procedure in central role. That is:\n  - All HCI APIs for obtaining or changing PHYs are supported for central role.\n\n @note The application is required to call both @ref sdc_support_phy_update_central() and @ref sdc_support_phy_update_peripheral()\n       if both central and peripheral roles are supported.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  LE Coded PHY is not supported."]
    pub fn sdc_support_phy_update_central() -> i32;
}
extern "C" {
    #[doc = "  Support LE Coded PHY for peripheral role\n\n After this API is called, the controller will support PHY update procedure in peripheral role. That is:\n  - All HCI APIs for obtaining or changing PHYs are supported for peripheral role.\n\n @note The application is required to call both @ref sdc_support_phy_update_central() and @ref sdc_support_phy_update_peripheral()\n       if both central and peripheral roles are supported.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  LE Coded PHY is not supported."]
    pub fn sdc_support_phy_update_peripheral() -> i32;
}
extern "C" {
    #[doc = "  Support LE Periodic Advertising in the Advertising state\n\n After this API is called, the controller will support the HCI commands\n related to the Periodic Advertising State.\n\n The application shall also call @ref sdc_support_ext_adv() to enable\n support for extended advertising before enabling support for periodic advertising.\n\n @note This API also enables support for ADI in periodic advertising packets.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  LE Periodic advertising is not supported."]
    pub fn sdc_support_le_periodic_adv() -> i32;
}
extern "C" {
    #[doc = "  Support LE Periodic Advertising in the Synchronization state\n\n After this API is called, the controller will support the HCI commands\n related to the Synchronization State.\n\n The application shall also call @ref sdc_support_ext_scan() to enable\n support for scanning for periodic advertisers before enabling support for\n this feature.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  LE Periodic advertising is not supported."]
    pub fn sdc_support_le_periodic_sync() -> i32;
}
extern "C" {
    #[doc = "  Support LE Periodic Advertising with Responses in the Advertising state\n\n After this API is called, the controller will support the HCI commands\n related to Periodic Advertising with Responses.\n\n The application shall also call @ref sdc_support_ext_adv(), @ref sdc_support_le_periodic_adv(),\n and at least one of @ref sdc_support_periodic_adv_sync_transfer_sender_central()\n and @ref sdc_support_periodic_adv_sync_transfer_sender_peripheral()\n to enable support for the extended advertising, periodic advertising,\n and sync transfer sender features before enabling support for\n Periodic Advertising with Responses.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  LE Periodic Advertising with Responses is not supported."]
    pub fn sdc_support_le_periodic_adv_with_rsp() -> i32;
}
extern "C" {
    #[doc = "  Support LE Periodic Advertising with Responses in the Synchronization state\n\n After this API is called, the controller will support the HCI commands\n related to Periodic Sync with Responses.\n\n The application shall also call @ref sdc_support_ext_adv(), @ref sdc_support_le_periodic_sync(),\n and at least one of @ref sdc_support_periodic_adv_sync_transfer_receiver_central and\n @ref sdc_support_periodic_adv_sync_transfer_receiver_peripheral to enable support for extended\n advertising, periodic advertising, and the sync transfer receiver features before enabling\n support for Periodic Sync with Responses.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  LE Periodic Sync with Responses is not supported."]
    pub fn sdc_support_le_periodic_sync_with_rsp() -> i32;
}
extern "C" {
    #[doc = "  Support LE Power Control for central role\n\n After this API is called, the controller will support the HCI commands\n related to the LE Power Control.\n\n @note The application is required to call both @ref sdc_support_le_power_control_central() and @ref sdc_support_le_power_control_peripheral()\n       if both central and peripheral roles are supported.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  LE Power Control is not supported."]
    pub fn sdc_support_le_power_control_central() -> i32;
}
extern "C" {
    #[doc = "  Support LE Power Control for peripheral role\n\n After this API is called, the controller will support the HCI commands\n related to the LE Power Control.\n\n @note The application is required to call both @ref sdc_support_le_power_control_central() and @ref sdc_support_le_power_control_peripheral()\n       if both central and peripheral roles are supported.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  LE Power Control is not supported."]
    pub fn sdc_support_le_power_control_peripheral() -> i32;
}
extern "C" {
    #[doc = "  Support Sleep Clock Accuracy (SCA) Update procedure for central role\n\n @note The application is required to call both @ref sdc_support_sca_central() and @ref sdc_support_sca_peripheral()\n       if both central and peripheral roles are supported.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  SCA Update procedure is not supported."]
    pub fn sdc_support_sca_central() -> i32;
}
extern "C" {
    #[doc = "  Support Sleep Clock Accuracy (SCA) Update procedure for peripheral role\n\n @note The application is required to call both @ref sdc_support_sca_central() and @ref sdc_support_sca_peripheral()\n       if both central and peripheral roles are supported.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  SCA Update procedure is not supported."]
    pub fn sdc_support_sca_peripheral() -> i32;
}
extern "C" {
    #[doc = "  Support LE Connection CTE response for central role\n\n After this API is called, the controller will support the HCI commands\n related to the LE Connection CTE Response.\n\n @note The application is required to call both @ref sdc_support_le_conn_cte_rsp_central() and @ref sdc_support_le_conn_cte_rsp_peripheral()\n       if both central and peripheral roles are supported.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  LE Connection CTE Response is not supported."]
    pub fn sdc_support_le_conn_cte_rsp_central() -> i32;
}
extern "C" {
    #[doc = "  Support LE Connection CTE response for peripheral role\n\n After this API is called, the controller will support the HCI commands\n related to the LE Connection CTE Response.\n\n @note The application is required to call both @ref sdc_support_le_conn_cte_rsp_central() and @ref sdc_support_le_conn_cte_rsp_peripheral()\n       if both central and peripheral roles are supported.\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  LE Connection CTE Response is not supported."]
    pub fn sdc_support_le_conn_cte_rsp_peripheral() -> i32;
}
extern "C" {
    #[doc = "  Support for sending periodic advertising sync transfers as central role\n\n @note The application is required to call both @ref sdc_support_periodic_adv_sync_transfer_sender_central()\n       and @ref sdc_support_periodic_adv_sync_transfer_sender_peripheral() if both central and peripheral roles are supported.\n\n Returns 0               Success\n Returns -NRF_EPERM      This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP Sending periodic advertising sync transfers is not supported."]
    pub fn sdc_support_periodic_adv_sync_transfer_sender_central() -> i32;
}
extern "C" {
    #[doc = "  Support for sending periodic advertising sync transfers as peripheral role\n\n @note The application is required to call both @ref sdc_support_periodic_adv_sync_transfer_sender_central()\n       and @ref sdc_support_periodic_adv_sync_transfer_sender_peripheral() if both central and peripheral roles are supported.\n\n Returns 0               Success\n Returns -NRF_EPERM      This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP Sending periodic advertising sync transfers is not supported."]
    pub fn sdc_support_periodic_adv_sync_transfer_sender_peripheral() -> i32;
}
extern "C" {
    #[doc = "  Support for receiving periodic advertising sync transfers as central role\n\n @note The application is required to call both @ref sdc_support_periodic_adv_sync_transfer_receiver_central()\n       and @ref sdc_support_periodic_adv_sync_transfer_receiver_peripheral() if both central and peripheral roles are supported.\n\n Returns 0               Success\n Returns -NRF_EPERM      This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP Receiving periodic advertising sync transfers is not supported."]
    pub fn sdc_support_periodic_adv_sync_transfer_receiver_central() -> i32;
}
extern "C" {
    #[doc = "  Support for receiving periodic advertising sync transfers as peripheral role\n\n @note The application is required to call both @ref sdc_support_periodic_adv_sync_transfer_receiver_central()\n       and @ref sdc_support_periodic_adv_sync_transfer_receiver_peripheral() if both central and peripheral roles are supported.\n\n Returns 0               Success\n Returns -NRF_EPERM      This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP Receiving periodic advertising sync transfers is not supported."]
    pub fn sdc_support_periodic_adv_sync_transfer_receiver_peripheral() -> i32;
}
extern "C" {
    #[doc = "  Support Connected Isochronous streams in the peripheral role\n\n After this API is called, the controller will support the HCI commands\n related to Connected Isochronous channels in the peripheral role\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  Connected Isochronous streams in the peripheral role is not supported."]
    pub fn sdc_support_cis_peripheral() -> i32;
}
extern "C" {
    #[doc = "  Support Connected Isochronous streams in the central role\n\n After this API is called, the controller will support the HCI commands\n related to Connected Isochronous channels in the central role\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  Connected Isochronous streams in the central role is not supported."]
    pub fn sdc_support_cis_central() -> i32;
}
extern "C" {
    #[doc = "  Support Broadcast Isochronous streams as a source\n\n After this API is called, the controller will support the HCI commands\n related to Broadcast Isochronous channels as a source\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  Broadcast Isochronous streams as a source is not supported."]
    pub fn sdc_support_bis_source() -> i32;
}
extern "C" {
    #[doc = "  Support Broadcast Isochronous streams as a sink\n\n After this API is called, the controller will support the HCI commands\n related to Broadcast Isochronous channels as a sink\n\n Returns 0                Success\n Returns -NRF_EPERM       This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP  Broadcast Isochronous streams as a sink is not supported."]
    pub fn sdc_support_bis_sink() -> i32;
}
extern "C" {
    #[doc = "  Support for Quality of Service (QoS) channel survey module\n\n After this API is called, the controller will support the @ref sdc_hci_cmd_vs_qos_channel_survey_enable HCI command\n\n Returns 0               Success\n Returns -NRF_EPERM      This API must be called before @ref sdc_cfg_set() or @ref sdc_enable().\n Returns -NRF_EOPNOTSUPP QoS channel survey is not supported."]
    pub fn sdc_support_qos_channel_survey() -> i32;
}
extern "C" {
    #[doc = "  Configure the coex advertising mode\n\n Configure how the advertiser behaves on denial of an advertising packet.\n The advertiser can be configured to carry on with the advertisement after the denial or\n to abort the advertising event, once an advertising packet gets denied.\n\n The default behavior is that the advertiser tries to carry on with the advertising event\n after the denial.\n\n @note Setting  * `adv_cont_on_denial` -  to True is not supported for the\n       @ref MPSL_COEX_1WIRE_GPIOTE_ID coex interface type.\n       Using the @ref MPSL_COEX_1WIRE_GPIOTE_ID coex interface without using this\n       API call with  * `adv_cont_on_denial` -  set to False will result in unexpected behavior.\n\n Returns 0                Success\n Returns -NRF_EOPNOTSUPP  The coexistence feature is not supported."]
    pub fn sdc_coex_adv_mode_configure(adv_cont_on_denial: bool_) -> i32;
}
extern "C" {
    #[doc = "  Support for setting the default radio TX power level\n\n This API sets the default power level for radio TX activity in the controller.\n\n The power level set will be equal to or less than the one requested, based on the values\n supported by the hardware used. Values outside the suported range will be set to the nearest\n supported value.\n\n  * `requested_power_level` -  represents the actual power level fed to the antenna.\n When a Front-End Module is used, gain values for the SoC and FEM are calculated\n automatically to guarantee the closest possible match to the value requested by the user\n at the RF output.\n\n * `requested_power_level` - The power level in dBm to use.\n\n Returns 0           Success\n Returns -NRF_EPERM  This API must be called before @ref sdc_enable()."]
    pub fn sdc_default_tx_power_set(requested_power_level: i8) -> i32;
}
#[doc = "  See @ref sdc_hci_cmd_cb_set_event_mask()."]
pub const sdc_hci_opcode_cb_SDC_HCI_OPCODE_CMD_CB_SET_EVENT_MASK: sdc_hci_opcode_cb = 3073;
#[doc = "  See @ref sdc_hci_cmd_cb_reset()."]
pub const sdc_hci_opcode_cb_SDC_HCI_OPCODE_CMD_CB_RESET: sdc_hci_opcode_cb = 3075;
#[doc = "  See @ref sdc_hci_cmd_cb_read_conn_accept_timeout()."]
pub const sdc_hci_opcode_cb_SDC_HCI_OPCODE_CMD_CB_READ_CONN_ACCEPT_TIMEOUT: sdc_hci_opcode_cb = 3093;
#[doc = "  See @ref sdc_hci_cmd_cb_write_conn_accept_timeout()."]
pub const sdc_hci_opcode_cb_SDC_HCI_OPCODE_CMD_CB_WRITE_CONN_ACCEPT_TIMEOUT: sdc_hci_opcode_cb = 3094;
#[doc = "  See @ref sdc_hci_cmd_cb_read_transmit_power_level()."]
pub const sdc_hci_opcode_cb_SDC_HCI_OPCODE_CMD_CB_READ_TRANSMIT_POWER_LEVEL: sdc_hci_opcode_cb = 3117;
#[doc = "  See @ref sdc_hci_cmd_cb_set_controller_to_host_flow_control()."]
pub const sdc_hci_opcode_cb_SDC_HCI_OPCODE_CMD_CB_SET_CONTROLLER_TO_HOST_FLOW_CONTROL: sdc_hci_opcode_cb = 3121;
#[doc = "  See @ref sdc_hci_cmd_cb_host_buffer_size()."]
pub const sdc_hci_opcode_cb_SDC_HCI_OPCODE_CMD_CB_HOST_BUFFER_SIZE: sdc_hci_opcode_cb = 3123;
#[doc = "  See @ref sdc_hci_cmd_cb_host_number_of_completed_packets()."]
pub const sdc_hci_opcode_cb_SDC_HCI_OPCODE_CMD_CB_HOST_NUMBER_OF_COMPLETED_PACKETS: sdc_hci_opcode_cb = 3125;
#[doc = "  See @ref sdc_hci_cmd_cb_set_event_mask_page_2()."]
pub const sdc_hci_opcode_cb_SDC_HCI_OPCODE_CMD_CB_SET_EVENT_MASK_PAGE_2: sdc_hci_opcode_cb = 3171;
#[doc = "  See @ref sdc_hci_cmd_cb_read_authenticated_payload_timeout()."]
pub const sdc_hci_opcode_cb_SDC_HCI_OPCODE_CMD_CB_READ_AUTHENTICATED_PAYLOAD_TIMEOUT: sdc_hci_opcode_cb = 3195;
#[doc = "  See @ref sdc_hci_cmd_cb_write_authenticated_payload_timeout()."]
pub const sdc_hci_opcode_cb_SDC_HCI_OPCODE_CMD_CB_WRITE_AUTHENTICATED_PAYLOAD_TIMEOUT: sdc_hci_opcode_cb = 3196;
#[doc = "  HCI CB OpCode Field values."]
pub type sdc_hci_opcode_cb = crate::ctypes::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cb_event_mask_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 7usize]>,
}
#[test]
fn bindgen_test_layout_sdc_hci_cb_event_mask_t() {
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cb_event_mask_t>(),
        7usize,
        concat!("Size of: ", stringify!(sdc_hci_cb_event_mask_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cb_event_mask_t>(),
        1usize,
        concat!("Alignment of ", stringify!(sdc_hci_cb_event_mask_t))
    );
}
impl sdc_hci_cb_event_mask_t {
    #[inline]
    pub fn inquiry_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_inquiry_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn inquiry_result_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_inquiry_result_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn connection_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_connection_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn connection_request_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_connection_request_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disconnection_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_disconnection_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn authentication_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_authentication_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn remote_name_request_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_remote_name_request_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn encryption_change_event_v1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_encryption_change_event_v1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn change_connection_link_key_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_change_connection_link_key_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn link_key_type_changed_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_link_key_type_changed_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn read_remote_supported_features_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_read_remote_supported_features_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn read_remote_version_information_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_read_remote_version_information_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn qos_setup_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_qos_setup_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hardware_error_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hardware_error_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn flush_occurred_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_flush_occurred_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn role_change_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_role_change_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mode_change_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mode_change_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn return_link_keys_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_return_link_keys_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pin_code_request_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pin_code_request_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn link_key_request_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_link_key_request_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn link_key_notification_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_link_key_notification_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn loopback_command_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_loopback_command_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn data_buffer_overflow_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_data_buffer_overflow_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn max_slots_change_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_max_slots_change_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn read_clock_offset_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_read_clock_offset_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn connection_packet_type_changed_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_connection_packet_type_changed_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn qos_violation_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(26usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_qos_violation_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(26usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used30(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used30(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn page_scan_repetition_mode_change_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_page_scan_repetition_mode_change_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn flow_specification_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_flow_specification_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn inquiry_result_with_rssi_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_inquiry_result_with_rssi_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn read_remote_extended_features_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_read_remote_extended_features_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn synchronous_connection_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(32usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_synchronous_connection_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(32usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn synchronous_connection_changed_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(33usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_synchronous_connection_changed_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(33usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn sniff_subrating_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(34usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sniff_subrating_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(34usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn extended_inquiry_result_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(35usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_extended_inquiry_result_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(35usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn encryption_key_refresh_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(36usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_encryption_key_refresh_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(36usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn io_capability_request_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(37usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_io_capability_request_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(37usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn io_capability_response_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(38usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_io_capability_response_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(38usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn user_confirmation_request_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(39usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_user_confirmation_request_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(39usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn user_passkey_request_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(40usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_user_passkey_request_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(40usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn remote_oob_data_request_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(41usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_remote_oob_data_request_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(41usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn simple_pairing_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(42usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_simple_pairing_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(42usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn link_supervision_timeout_changed_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(43usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_link_supervision_timeout_changed_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(43usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enhanced_flush_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(44usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enhanced_flush_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(44usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn user_passkey_notification_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(45usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_user_passkey_notification_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(45usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn keypress_notification_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(46usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_keypress_notification_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(46usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn remote_host_supported_features_notification_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(47usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_remote_host_supported_features_notification_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(47usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn le_meta_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(48usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_le_meta_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(48usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        inquiry_complete_event: u8,
        inquiry_result_event: u8,
        connection_complete_event: u8,
        connection_request_event: u8,
        disconnection_complete_event: u8,
        authentication_complete_event: u8,
        remote_name_request_complete_event: u8,
        encryption_change_event_v1: u8,
        change_connection_link_key_complete_event: u8,
        link_key_type_changed_event: u8,
        read_remote_supported_features_complete_event: u8,
        read_remote_version_information_complete_event: u8,
        qos_setup_complete_event: u8,
        hardware_error_event: u8,
        flush_occurred_event: u8,
        role_change_event: u8,
        mode_change_event: u8,
        return_link_keys_event: u8,
        pin_code_request_event: u8,
        link_key_request_event: u8,
        link_key_notification_event: u8,
        loopback_command_event: u8,
        data_buffer_overflow_event: u8,
        max_slots_change_event: u8,
        read_clock_offset_complete_event: u8,
        connection_packet_type_changed_event: u8,
        qos_violation_event: u8,
        previously_used30: u8,
        page_scan_repetition_mode_change_event: u8,
        flow_specification_complete_event: u8,
        inquiry_result_with_rssi_event: u8,
        read_remote_extended_features_complete_event: u8,
        synchronous_connection_complete_event: u8,
        synchronous_connection_changed_event: u8,
        sniff_subrating_event: u8,
        extended_inquiry_result_event: u8,
        encryption_key_refresh_complete_event: u8,
        io_capability_request_event: u8,
        io_capability_response_event: u8,
        user_confirmation_request_event: u8,
        user_passkey_request_event: u8,
        remote_oob_data_request_event: u8,
        simple_pairing_complete_event: u8,
        link_supervision_timeout_changed_event: u8,
        enhanced_flush_complete_event: u8,
        user_passkey_notification_event: u8,
        keypress_notification_event: u8,
        remote_host_supported_features_notification_event: u8,
        le_meta_event: u8,
    ) -> __BindgenBitfieldUnit<[u8; 7usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 7usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let inquiry_complete_event: u8 = unsafe { ::core::mem::transmute(inquiry_complete_event) };
            inquiry_complete_event as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let inquiry_result_event: u8 = unsafe { ::core::mem::transmute(inquiry_result_event) };
            inquiry_result_event as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let connection_complete_event: u8 = unsafe { ::core::mem::transmute(connection_complete_event) };
            connection_complete_event as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let connection_request_event: u8 = unsafe { ::core::mem::transmute(connection_request_event) };
            connection_request_event as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let disconnection_complete_event: u8 = unsafe { ::core::mem::transmute(disconnection_complete_event) };
            disconnection_complete_event as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let authentication_complete_event: u8 = unsafe { ::core::mem::transmute(authentication_complete_event) };
            authentication_complete_event as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let remote_name_request_complete_event: u8 =
                unsafe { ::core::mem::transmute(remote_name_request_complete_event) };
            remote_name_request_complete_event as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let encryption_change_event_v1: u8 = unsafe { ::core::mem::transmute(encryption_change_event_v1) };
            encryption_change_event_v1 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let change_connection_link_key_complete_event: u8 =
                unsafe { ::core::mem::transmute(change_connection_link_key_complete_event) };
            change_connection_link_key_complete_event as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let link_key_type_changed_event: u8 = unsafe { ::core::mem::transmute(link_key_type_changed_event) };
            link_key_type_changed_event as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let read_remote_supported_features_complete_event: u8 =
                unsafe { ::core::mem::transmute(read_remote_supported_features_complete_event) };
            read_remote_supported_features_complete_event as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let read_remote_version_information_complete_event: u8 =
                unsafe { ::core::mem::transmute(read_remote_version_information_complete_event) };
            read_remote_version_information_complete_event as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let qos_setup_complete_event: u8 = unsafe { ::core::mem::transmute(qos_setup_complete_event) };
            qos_setup_complete_event as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let hardware_error_event: u8 = unsafe { ::core::mem::transmute(hardware_error_event) };
            hardware_error_event as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let flush_occurred_event: u8 = unsafe { ::core::mem::transmute(flush_occurred_event) };
            flush_occurred_event as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let role_change_event: u8 = unsafe { ::core::mem::transmute(role_change_event) };
            role_change_event as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let mode_change_event: u8 = unsafe { ::core::mem::transmute(mode_change_event) };
            mode_change_event as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let return_link_keys_event: u8 = unsafe { ::core::mem::transmute(return_link_keys_event) };
            return_link_keys_event as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let pin_code_request_event: u8 = unsafe { ::core::mem::transmute(pin_code_request_event) };
            pin_code_request_event as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let link_key_request_event: u8 = unsafe { ::core::mem::transmute(link_key_request_event) };
            link_key_request_event as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let link_key_notification_event: u8 = unsafe { ::core::mem::transmute(link_key_notification_event) };
            link_key_notification_event as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let loopback_command_event: u8 = unsafe { ::core::mem::transmute(loopback_command_event) };
            loopback_command_event as u64
        });
        __bindgen_bitfield_unit.set(22usize, 1u8, {
            let data_buffer_overflow_event: u8 = unsafe { ::core::mem::transmute(data_buffer_overflow_event) };
            data_buffer_overflow_event as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let max_slots_change_event: u8 = unsafe { ::core::mem::transmute(max_slots_change_event) };
            max_slots_change_event as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let read_clock_offset_complete_event: u8 =
                unsafe { ::core::mem::transmute(read_clock_offset_complete_event) };
            read_clock_offset_complete_event as u64
        });
        __bindgen_bitfield_unit.set(25usize, 1u8, {
            let connection_packet_type_changed_event: u8 =
                unsafe { ::core::mem::transmute(connection_packet_type_changed_event) };
            connection_packet_type_changed_event as u64
        });
        __bindgen_bitfield_unit.set(26usize, 1u8, {
            let qos_violation_event: u8 = unsafe { ::core::mem::transmute(qos_violation_event) };
            qos_violation_event as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let previously_used30: u8 = unsafe { ::core::mem::transmute(previously_used30) };
            previously_used30 as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let page_scan_repetition_mode_change_event: u8 =
                unsafe { ::core::mem::transmute(page_scan_repetition_mode_change_event) };
            page_scan_repetition_mode_change_event as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let flow_specification_complete_event: u8 =
                unsafe { ::core::mem::transmute(flow_specification_complete_event) };
            flow_specification_complete_event as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let inquiry_result_with_rssi_event: u8 = unsafe { ::core::mem::transmute(inquiry_result_with_rssi_event) };
            inquiry_result_with_rssi_event as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let read_remote_extended_features_complete_event: u8 =
                unsafe { ::core::mem::transmute(read_remote_extended_features_complete_event) };
            read_remote_extended_features_complete_event as u64
        });
        __bindgen_bitfield_unit.set(32usize, 1u8, {
            let synchronous_connection_complete_event: u8 =
                unsafe { ::core::mem::transmute(synchronous_connection_complete_event) };
            synchronous_connection_complete_event as u64
        });
        __bindgen_bitfield_unit.set(33usize, 1u8, {
            let synchronous_connection_changed_event: u8 =
                unsafe { ::core::mem::transmute(synchronous_connection_changed_event) };
            synchronous_connection_changed_event as u64
        });
        __bindgen_bitfield_unit.set(34usize, 1u8, {
            let sniff_subrating_event: u8 = unsafe { ::core::mem::transmute(sniff_subrating_event) };
            sniff_subrating_event as u64
        });
        __bindgen_bitfield_unit.set(35usize, 1u8, {
            let extended_inquiry_result_event: u8 = unsafe { ::core::mem::transmute(extended_inquiry_result_event) };
            extended_inquiry_result_event as u64
        });
        __bindgen_bitfield_unit.set(36usize, 1u8, {
            let encryption_key_refresh_complete_event: u8 =
                unsafe { ::core::mem::transmute(encryption_key_refresh_complete_event) };
            encryption_key_refresh_complete_event as u64
        });
        __bindgen_bitfield_unit.set(37usize, 1u8, {
            let io_capability_request_event: u8 = unsafe { ::core::mem::transmute(io_capability_request_event) };
            io_capability_request_event as u64
        });
        __bindgen_bitfield_unit.set(38usize, 1u8, {
            let io_capability_response_event: u8 = unsafe { ::core::mem::transmute(io_capability_response_event) };
            io_capability_response_event as u64
        });
        __bindgen_bitfield_unit.set(39usize, 1u8, {
            let user_confirmation_request_event: u8 =
                unsafe { ::core::mem::transmute(user_confirmation_request_event) };
            user_confirmation_request_event as u64
        });
        __bindgen_bitfield_unit.set(40usize, 1u8, {
            let user_passkey_request_event: u8 = unsafe { ::core::mem::transmute(user_passkey_request_event) };
            user_passkey_request_event as u64
        });
        __bindgen_bitfield_unit.set(41usize, 1u8, {
            let remote_oob_data_request_event: u8 = unsafe { ::core::mem::transmute(remote_oob_data_request_event) };
            remote_oob_data_request_event as u64
        });
        __bindgen_bitfield_unit.set(42usize, 1u8, {
            let simple_pairing_complete_event: u8 = unsafe { ::core::mem::transmute(simple_pairing_complete_event) };
            simple_pairing_complete_event as u64
        });
        __bindgen_bitfield_unit.set(43usize, 1u8, {
            let link_supervision_timeout_changed_event: u8 =
                unsafe { ::core::mem::transmute(link_supervision_timeout_changed_event) };
            link_supervision_timeout_changed_event as u64
        });
        __bindgen_bitfield_unit.set(44usize, 1u8, {
            let enhanced_flush_complete_event: u8 = unsafe { ::core::mem::transmute(enhanced_flush_complete_event) };
            enhanced_flush_complete_event as u64
        });
        __bindgen_bitfield_unit.set(45usize, 1u8, {
            let user_passkey_notification_event: u8 =
                unsafe { ::core::mem::transmute(user_passkey_notification_event) };
            user_passkey_notification_event as u64
        });
        __bindgen_bitfield_unit.set(46usize, 1u8, {
            let keypress_notification_event: u8 = unsafe { ::core::mem::transmute(keypress_notification_event) };
            keypress_notification_event as u64
        });
        __bindgen_bitfield_unit.set(47usize, 1u8, {
            let remote_host_supported_features_notification_event: u8 =
                unsafe { ::core::mem::transmute(remote_host_supported_features_notification_event) };
            remote_host_supported_features_notification_event as u64
        });
        __bindgen_bitfield_unit.set(48usize, 1u8, {
            let le_meta_event: u8 = unsafe { ::core::mem::transmute(le_meta_event) };
            le_meta_event as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cb_event_mask_page_2_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_sdc_hci_cb_event_mask_page_2_t() {
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cb_event_mask_page_2_t>(),
        4usize,
        concat!("Size of: ", stringify!(sdc_hci_cb_event_mask_page_2_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cb_event_mask_page_2_t>(),
        1usize,
        concat!("Alignment of ", stringify!(sdc_hci_cb_event_mask_page_2_t))
    );
}
impl sdc_hci_cb_event_mask_page_2_t {
    #[inline]
    pub fn previously_used0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used5(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used5(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn number_of_completed_data_blocks_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_number_of_completed_data_blocks_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used9(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used9(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used10(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used10(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used11(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used11(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used12(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used12(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used13(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used13(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn triggered_clock_capture_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_triggered_clock_capture_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn synchronization_train_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_synchronization_train_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn synchronization_train_received_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_synchronization_train_received_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn connectionless_peripheral_broadcast_receive_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_connectionless_peripheral_broadcast_receive_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn connectionless_peripheral_broadcast_timeout_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_connectionless_peripheral_broadcast_timeout_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn truncated_page_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_truncated_page_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn peripheral_page_response_timeout_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_peripheral_page_response_timeout_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn connectionless_peripheral_broadcast_channel_map_change_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_connectionless_peripheral_broadcast_channel_map_change_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn inquiry_response_notification_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_inquiry_response_notification_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn authenticated_payload_timeout_expired_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_authenticated_payload_timeout_expired_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn sam_status_change_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sam_status_change_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn encryption_change_event_v2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_encryption_change_event_v2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        previously_used0: u8,
        previously_used1: u8,
        previously_used2: u8,
        previously_used3: u8,
        previously_used4: u8,
        previously_used5: u8,
        previously_used6: u8,
        previously_used7: u8,
        number_of_completed_data_blocks_event: u8,
        previously_used9: u8,
        previously_used10: u8,
        previously_used11: u8,
        previously_used12: u8,
        previously_used13: u8,
        triggered_clock_capture_event: u8,
        synchronization_train_complete_event: u8,
        synchronization_train_received_event: u8,
        connectionless_peripheral_broadcast_receive_event: u8,
        connectionless_peripheral_broadcast_timeout_event: u8,
        truncated_page_complete_event: u8,
        peripheral_page_response_timeout_event: u8,
        connectionless_peripheral_broadcast_channel_map_change_event: u8,
        inquiry_response_notification_event: u8,
        authenticated_payload_timeout_expired_event: u8,
        sam_status_change_event: u8,
        encryption_change_event_v2: u8,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let previously_used0: u8 = unsafe { ::core::mem::transmute(previously_used0) };
            previously_used0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let previously_used1: u8 = unsafe { ::core::mem::transmute(previously_used1) };
            previously_used1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let previously_used2: u8 = unsafe { ::core::mem::transmute(previously_used2) };
            previously_used2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let previously_used3: u8 = unsafe { ::core::mem::transmute(previously_used3) };
            previously_used3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let previously_used4: u8 = unsafe { ::core::mem::transmute(previously_used4) };
            previously_used4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let previously_used5: u8 = unsafe { ::core::mem::transmute(previously_used5) };
            previously_used5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let previously_used6: u8 = unsafe { ::core::mem::transmute(previously_used6) };
            previously_used6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let previously_used7: u8 = unsafe { ::core::mem::transmute(previously_used7) };
            previously_used7 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let number_of_completed_data_blocks_event: u8 =
                unsafe { ::core::mem::transmute(number_of_completed_data_blocks_event) };
            number_of_completed_data_blocks_event as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let previously_used9: u8 = unsafe { ::core::mem::transmute(previously_used9) };
            previously_used9 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let previously_used10: u8 = unsafe { ::core::mem::transmute(previously_used10) };
            previously_used10 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let previously_used11: u8 = unsafe { ::core::mem::transmute(previously_used11) };
            previously_used11 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let previously_used12: u8 = unsafe { ::core::mem::transmute(previously_used12) };
            previously_used12 as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let previously_used13: u8 = unsafe { ::core::mem::transmute(previously_used13) };
            previously_used13 as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let triggered_clock_capture_event: u8 = unsafe { ::core::mem::transmute(triggered_clock_capture_event) };
            triggered_clock_capture_event as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let synchronization_train_complete_event: u8 =
                unsafe { ::core::mem::transmute(synchronization_train_complete_event) };
            synchronization_train_complete_event as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let synchronization_train_received_event: u8 =
                unsafe { ::core::mem::transmute(synchronization_train_received_event) };
            synchronization_train_received_event as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let connectionless_peripheral_broadcast_receive_event: u8 =
                unsafe { ::core::mem::transmute(connectionless_peripheral_broadcast_receive_event) };
            connectionless_peripheral_broadcast_receive_event as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let connectionless_peripheral_broadcast_timeout_event: u8 =
                unsafe { ::core::mem::transmute(connectionless_peripheral_broadcast_timeout_event) };
            connectionless_peripheral_broadcast_timeout_event as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let truncated_page_complete_event: u8 = unsafe { ::core::mem::transmute(truncated_page_complete_event) };
            truncated_page_complete_event as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let peripheral_page_response_timeout_event: u8 =
                unsafe { ::core::mem::transmute(peripheral_page_response_timeout_event) };
            peripheral_page_response_timeout_event as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let connectionless_peripheral_broadcast_channel_map_change_event: u8 =
                unsafe { ::core::mem::transmute(connectionless_peripheral_broadcast_channel_map_change_event) };
            connectionless_peripheral_broadcast_channel_map_change_event as u64
        });
        __bindgen_bitfield_unit.set(22usize, 1u8, {
            let inquiry_response_notification_event: u8 =
                unsafe { ::core::mem::transmute(inquiry_response_notification_event) };
            inquiry_response_notification_event as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let authenticated_payload_timeout_expired_event: u8 =
                unsafe { ::core::mem::transmute(authenticated_payload_timeout_expired_event) };
            authenticated_payload_timeout_expired_event as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let sam_status_change_event: u8 = unsafe { ::core::mem::transmute(sam_status_change_event) };
            sam_status_change_event as u64
        });
        __bindgen_bitfield_unit.set(25usize, 1u8, {
            let encryption_change_event_v2: u8 = unsafe { ::core::mem::transmute(encryption_change_event_v2) };
            encryption_change_event_v2 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cb_host_number_of_completed_packets_array_params_t {
    pub conn_handle: u16,
    pub host_num_completed_packets: u16,
}
#[test]
fn bindgen_test_layout_sdc_hci_cb_host_number_of_completed_packets_array_params_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_hci_cb_host_number_of_completed_packets_array_params_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cb_host_number_of_completed_packets_array_params_t>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(sdc_hci_cb_host_number_of_completed_packets_array_params_t)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cb_host_number_of_completed_packets_array_params_t>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sdc_hci_cb_host_number_of_completed_packets_array_params_t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conn_handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cb_host_number_of_completed_packets_array_params_t),
            "::",
            stringify!(conn_handle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).host_num_completed_packets) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cb_host_number_of_completed_packets_array_params_t),
            "::",
            stringify!(host_num_completed_packets)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub union sdc_hci_cmd_cb_set_event_mask_t {
    pub params: sdc_hci_cb_event_mask_t,
    pub raw: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_sdc_hci_cmd_cb_set_event_mask_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_hci_cmd_cb_set_event_mask_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cmd_cb_set_event_mask_t>(),
        8usize,
        concat!("Size of: ", stringify!(sdc_hci_cmd_cb_set_event_mask_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cmd_cb_set_event_mask_t>(),
        1usize,
        concat!("Alignment of ", stringify!(sdc_hci_cmd_cb_set_event_mask_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).params) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_set_event_mask_t),
            "::",
            stringify!(params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).raw) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_set_event_mask_t),
            "::",
            stringify!(raw)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_read_conn_accept_timeout_return_t {
    pub conn_accept_timeout: u16,
}
#[test]
fn bindgen_test_layout_sdc_hci_cmd_cb_read_conn_accept_timeout_return_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_hci_cmd_cb_read_conn_accept_timeout_return_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cmd_cb_read_conn_accept_timeout_return_t>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(sdc_hci_cmd_cb_read_conn_accept_timeout_return_t)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cmd_cb_read_conn_accept_timeout_return_t>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sdc_hci_cmd_cb_read_conn_accept_timeout_return_t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conn_accept_timeout) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_read_conn_accept_timeout_return_t),
            "::",
            stringify!(conn_accept_timeout)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_write_conn_accept_timeout_t {
    pub conn_accept_timeout: u16,
}
#[test]
fn bindgen_test_layout_sdc_hci_cmd_cb_write_conn_accept_timeout_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_hci_cmd_cb_write_conn_accept_timeout_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cmd_cb_write_conn_accept_timeout_t>(),
        2usize,
        concat!("Size of: ", stringify!(sdc_hci_cmd_cb_write_conn_accept_timeout_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cmd_cb_write_conn_accept_timeout_t>(),
        1usize,
        concat!("Alignment of ", stringify!(sdc_hci_cmd_cb_write_conn_accept_timeout_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conn_accept_timeout) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_write_conn_accept_timeout_t),
            "::",
            stringify!(conn_accept_timeout)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_read_transmit_power_level_t {
    pub conn_handle: u16,
    pub type_: u8,
}
#[test]
fn bindgen_test_layout_sdc_hci_cmd_cb_read_transmit_power_level_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_hci_cmd_cb_read_transmit_power_level_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cmd_cb_read_transmit_power_level_t>(),
        3usize,
        concat!("Size of: ", stringify!(sdc_hci_cmd_cb_read_transmit_power_level_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cmd_cb_read_transmit_power_level_t>(),
        1usize,
        concat!("Alignment of ", stringify!(sdc_hci_cmd_cb_read_transmit_power_level_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conn_handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_read_transmit_power_level_t),
            "::",
            stringify!(conn_handle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_read_transmit_power_level_t),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_read_transmit_power_level_return_t {
    pub conn_handle: u16,
    pub tx_power_level: i8,
}
#[test]
fn bindgen_test_layout_sdc_hci_cmd_cb_read_transmit_power_level_return_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_hci_cmd_cb_read_transmit_power_level_return_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cmd_cb_read_transmit_power_level_return_t>(),
        3usize,
        concat!(
            "Size of: ",
            stringify!(sdc_hci_cmd_cb_read_transmit_power_level_return_t)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cmd_cb_read_transmit_power_level_return_t>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sdc_hci_cmd_cb_read_transmit_power_level_return_t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conn_handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_read_transmit_power_level_return_t),
            "::",
            stringify!(conn_handle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_power_level) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_read_transmit_power_level_return_t),
            "::",
            stringify!(tx_power_level)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_set_controller_to_host_flow_control_t {
    pub flow_control_enable: u8,
}
#[test]
fn bindgen_test_layout_sdc_hci_cmd_cb_set_controller_to_host_flow_control_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_hci_cmd_cb_set_controller_to_host_flow_control_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cmd_cb_set_controller_to_host_flow_control_t>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(sdc_hci_cmd_cb_set_controller_to_host_flow_control_t)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cmd_cb_set_controller_to_host_flow_control_t>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sdc_hci_cmd_cb_set_controller_to_host_flow_control_t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flow_control_enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_set_controller_to_host_flow_control_t),
            "::",
            stringify!(flow_control_enable)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_host_buffer_size_t {
    pub host_acl_data_packet_length: u16,
    pub host_sync_data_packet_length: u8,
    pub host_total_num_acl_data_packets: u16,
    pub host_total_num_sync_data_packets: u16,
}
#[test]
fn bindgen_test_layout_sdc_hci_cmd_cb_host_buffer_size_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_hci_cmd_cb_host_buffer_size_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cmd_cb_host_buffer_size_t>(),
        7usize,
        concat!("Size of: ", stringify!(sdc_hci_cmd_cb_host_buffer_size_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cmd_cb_host_buffer_size_t>(),
        1usize,
        concat!("Alignment of ", stringify!(sdc_hci_cmd_cb_host_buffer_size_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).host_acl_data_packet_length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_host_buffer_size_t),
            "::",
            stringify!(host_acl_data_packet_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).host_sync_data_packet_length) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_host_buffer_size_t),
            "::",
            stringify!(host_sync_data_packet_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).host_total_num_acl_data_packets) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_host_buffer_size_t),
            "::",
            stringify!(host_total_num_acl_data_packets)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).host_total_num_sync_data_packets) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_host_buffer_size_t),
            "::",
            stringify!(host_total_num_sync_data_packets)
        )
    );
}
#[repr(C, packed)]
pub struct sdc_hci_cmd_cb_host_number_of_completed_packets_t {
    pub num_handles: u8,
    pub array_params: __IncompleteArrayField<sdc_hci_cb_host_number_of_completed_packets_array_params_t>,
}
#[test]
fn bindgen_test_layout_sdc_hci_cmd_cb_host_number_of_completed_packets_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_hci_cmd_cb_host_number_of_completed_packets_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cmd_cb_host_number_of_completed_packets_t>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(sdc_hci_cmd_cb_host_number_of_completed_packets_t)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cmd_cb_host_number_of_completed_packets_t>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sdc_hci_cmd_cb_host_number_of_completed_packets_t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_handles) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_host_number_of_completed_packets_t),
            "::",
            stringify!(num_handles)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).array_params) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_host_number_of_completed_packets_t),
            "::",
            stringify!(array_params)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub union sdc_hci_cmd_cb_set_event_mask_page_2_t {
    pub params: sdc_hci_cb_event_mask_page_2_t,
    pub raw: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_sdc_hci_cmd_cb_set_event_mask_page_2_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_hci_cmd_cb_set_event_mask_page_2_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cmd_cb_set_event_mask_page_2_t>(),
        8usize,
        concat!("Size of: ", stringify!(sdc_hci_cmd_cb_set_event_mask_page_2_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cmd_cb_set_event_mask_page_2_t>(),
        1usize,
        concat!("Alignment of ", stringify!(sdc_hci_cmd_cb_set_event_mask_page_2_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).params) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_set_event_mask_page_2_t),
            "::",
            stringify!(params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).raw) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_set_event_mask_page_2_t),
            "::",
            stringify!(raw)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_read_authenticated_payload_timeout_t {
    pub conn_handle: u16,
}
#[test]
fn bindgen_test_layout_sdc_hci_cmd_cb_read_authenticated_payload_timeout_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_hci_cmd_cb_read_authenticated_payload_timeout_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cmd_cb_read_authenticated_payload_timeout_t>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(sdc_hci_cmd_cb_read_authenticated_payload_timeout_t)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cmd_cb_read_authenticated_payload_timeout_t>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sdc_hci_cmd_cb_read_authenticated_payload_timeout_t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conn_handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_read_authenticated_payload_timeout_t),
            "::",
            stringify!(conn_handle)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t {
    pub conn_handle: u16,
    pub authenticated_payload_timeout: u16,
}
#[test]
fn bindgen_test_layout_sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conn_handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t),
            "::",
            stringify!(conn_handle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).authenticated_payload_timeout) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t),
            "::",
            stringify!(authenticated_payload_timeout)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_write_authenticated_payload_timeout_t {
    pub conn_handle: u16,
    pub authenticated_payload_timeout: u16,
}
#[test]
fn bindgen_test_layout_sdc_hci_cmd_cb_write_authenticated_payload_timeout_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_hci_cmd_cb_write_authenticated_payload_timeout_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cmd_cb_write_authenticated_payload_timeout_t>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(sdc_hci_cmd_cb_write_authenticated_payload_timeout_t)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cmd_cb_write_authenticated_payload_timeout_t>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sdc_hci_cmd_cb_write_authenticated_payload_timeout_t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conn_handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_write_authenticated_payload_timeout_t),
            "::",
            stringify!(conn_handle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).authenticated_payload_timeout) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_write_authenticated_payload_timeout_t),
            "::",
            stringify!(authenticated_payload_timeout)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t {
    pub conn_handle: u16,
}
#[test]
fn bindgen_test_layout_sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t() {
    const UNINIT: ::core::mem::MaybeUninit<sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conn_handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t),
            "::",
            stringify!(conn_handle)
        )
    );
}
extern "C" {
    #[doc = " @defgroup HCI_VS_API API\n @{\n/\n/** @brief Set Event Mask.\n\n The description below is extracted from Core_v5.4,\n Vol 4, Part E, Section 7.3.1\n\n The HCI_Set_Event_Mask command is used to control which events are\n generated by the HCI for the Host. If the bit in the Event_Mask is set to a one,\n then the event associated with that bit will be enabled. For an LE Controller, the\n LE Meta event bit in the event_Mask shall enable or disable all LE events in\n the LE Meta event (see Section 7.7.65). The event mask allows the Host to\n control how much it is interrupted.\n\n The Controller shall ignore those bits which are reserved for future use or\n represent events which it does not support. If the Host sets any of these bits to\n 1, the Controller shall act as if they were set to 0.\n\n Event(s) generated (unless masked away):\n When the HCI_Set_Event_Mask command has completed, an\n HCI_Command_Complete event shall be generated.\n\n * `p_params` - Input parameters.\n\n Returns 0 if success.\n Returns Returns value between 0x01-0xFF in case of error.\n         See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_set_event_mask(p_params: *const sdc_hci_cmd_cb_set_event_mask_t) -> u8;
}
extern "C" {
    #[doc = "  Reset.\n\n The description below is extracted from Core_v5.4,\n Vol 4, Part E, Section 7.3.2\n\n The HCI_Reset command will reset the Controller and the Link Manager on the\n BR/EDR Controller or the Link Layer on an LE Controller. If the Controller\n supports both BR/EDR and LE then the HCI_Reset command shall reset the\n Link Manager, Baseband and Link Layer. The HCI_Reset command shall not\n affect the used HCI transport layer since the HCI transport layers may have\n reset mechanisms of their own. After the reset is completed, the current\n operational state will be lost, the Controller will enter standby mode and the\n Controller will automatically revert to the default values for the parameters for\n which default values are defined in the specification.\n\n Note: The HCI_Reset command will not necessarily perform a hardware reset.\n This is implementation defined.\n\n The Host shall not send additional HCI commands before the\n HCI_Command_Complete event related to the HCI_Reset command has been\n received.\n\n Event(s) generated (unless masked away):\n When the reset has been performed, an HCI_Command_Complete event shall\n be generated.\n\n\n Returns 0 if success.\n Returns Returns value between 0x01-0xFF in case of error.\n         See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_reset() -> u8;
}
extern "C" {
    #[doc = "  Read Connection Accept Timeout.\n\n The description below is extracted from Core_v5.4,\n Vol 4, Part E, Section 7.3.13\n\n This command reads the value for the Connection_Accept_Timeout\n configuration parameter. See Section 6.7.\n\n Event(s) generated (unless masked away):\n When the HCI_Read_Connection_Timeout command has completed, an\n HCI_Command_Complete event shall be generated.\n\n * `p_return` - Extra return parameters.\n\n Returns 0 if success.\n Returns Returns value between 0x01-0xFF in case of error.\n         See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_read_conn_accept_timeout(
        p_return: *mut sdc_hci_cmd_cb_read_conn_accept_timeout_return_t,
    ) -> u8;
}
extern "C" {
    #[doc = "  Write Connection Accept Timeout.\n\n The description below is extracted from Core_v5.4,\n Vol 4, Part E, Section 7.3.14\n\n This command writes the value for the Connection_Accept_Timeout\n configuration parameter. See Section 6.7.\n\n Event(s) generated (unless masked away):\n When the HCI_Write_Connection_Accept_Timeout command has completed,\n an HCI_Command_Complete event shall be generated.\n\n * `p_params` - Input parameters.\n\n Returns 0 if success.\n Returns Returns value between 0x01-0xFF in case of error.\n         See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_write_conn_accept_timeout(p_params: *const sdc_hci_cmd_cb_write_conn_accept_timeout_t) -> u8;
}
extern "C" {
    #[doc = "  Read Transmit Power Level.\n\n The description below is extracted from Core_v5.4,\n Vol 4, Part E, Section 7.3.35\n\n This command reads the values for the TX_Power_Level parameter for the\n specified Connection_Handle. The Connection_Handle shall be a\n Connection_Handle for an ACL connection.\n\n Event(s) generated (unless masked away):\n When the HCI_Read_Transmit_Power_Level command has completed, an\n HCI_Command_Complete event shall be generated.\n\n * `p_params` - Input parameters.\n * `p_return` - Extra return parameters.\n\n Returns 0 if success.\n Returns Returns value between 0x01-0xFF in case of error.\n         See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_read_transmit_power_level(
        p_params: *const sdc_hci_cmd_cb_read_transmit_power_level_t,
        p_return: *mut sdc_hci_cmd_cb_read_transmit_power_level_return_t,
    ) -> u8;
}
extern "C" {
    #[doc = "  Set Controller To Host Flow Control.\n\n The description below is extracted from Core_v5.4,\n Vol 4, Part E, Section 7.3.38\n\n This command is used by the Host to turn flow control on or off for data and/or\n voice sent in the direction from the Controller to the Host. If flow control is turned\n off, the Host should not send the HCI_Host_Number_Of_Completed_Packets\n command. That command will be ignored by the Controller if it is sent by the\n Host and flow control is off. If flow control is turned on for HCI ACL Data packets\n and off for HCI Synchronous Data packets, HCI_Host_Number_Of_Completed_-\n Packets commands sent by the Host should only contain Connection_Handles\n for ACL connections. If flow control is turned off for HCI ACL Data packets and\n on for HCI Synchronous Data packets, HCI_Host_Number_Of_Completed_-\n Packets commands sent by the Host should only contain Connection_Handles\n for synchronous connections. If flow control is turned on for HCI ACL Data\n packets and HCI Synchronous Data packets, the Host will send HCI_Host_-\n Number_Of_Completed_Packets commands both for ACL connections and\n synchronous connections.\n\n The Flow_Control_Enable parameter shall only be changed if no connections\n exist.\n\n Event(s) generated (unless masked away):\n When the HCI_Set_Controller_To_Host_Flow_Control command has\n completed, an HCI_Command_Complete event shall be generated.\n\n * `p_params` - Input parameters.\n\n Returns 0 if success.\n Returns Returns value between 0x01-0xFF in case of error.\n         See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_set_controller_to_host_flow_control(
        p_params: *const sdc_hci_cmd_cb_set_controller_to_host_flow_control_t,
    ) -> u8;
}
extern "C" {
    #[doc = "  Host Buffer Size.\n\n The description below is extracted from Core_v5.4,\n Vol 4, Part E, Section 7.3.39\n\n The HCI_Host_Buffer_Size command is used by the Host to notify the\n Controller about the maximum size of the data portion of HCI ACL and\n Synchronous Data packets sent from the Controller to the Host. The Controller\n shall segment the data to be transmitted from the Controller to the Host\n according to these sizes, so that the HCI Data packets will contain data with up\n to these sizes. The HCI_Host_Buffer_Size command also notifies the\n Controller about the total number of HCI ACL and Synchronous Data packets\n that can be stored in the data buffers of the Host. If flow control from the\n Controller to the Host is turned off, and the HCI_Host_Buffer_Size command\n has not been issued by the Host, this means that the Controller will send HCI\n Data packets to the Host with any lengths the Controller wants to use, and it is\n assumed that the data buffer sizes of the Host are unlimited. If flow control from\n the Controller to the Host is turned on, the HCI_Host_Buffer_Size command\n shall after a power-on or a reset always be sent by the Host before the first\n HCI_Host_Number_Of_Completed_Packets command is sent.\n\n The Set Controller To Host Flow Control command is used to turn flow control\n on or off. The Host_ACL_Data_Packet_Length command parameter will be\n used to determine the size of the L2CAP segments contained in ACL Data\n packets, which are transferred from the Controller to the Host. The\n Host_Synchronous_Data_Packet_Length command parameter is used to\n determine the maximum size of HCI Synchronous Data packets. Both the Host\n and the Controller shall support command and event packets, where the data\n portion (excluding header) contained in the packets is 255 octets in size.\n\n The Host_Total_Num_ACL_Data_Packets command parameter contains the\n total number of HCI ACL Data packets that can be stored in the data buffers of\n the Host. The Controller will determine how the buffers are to be divided\n between different Connection_Handles. The Host_Total_Num_Synchronous_-\n Data_Packets command parameter gives the same information for HCI\n Synchronous Data packets. If the Host does not support SCO or eSCO over\n HCI, then it shall set Host_Total_Num_Synchronous_Data_Packets to zero, in\n which case the Controller shall ignore the Host_Synchronous_Data_Packet_-\n Length parameter.\n Note: The Host_ACL_Data_Packet_Length and Host_Synchronous_Data_-\n Packet_Length command parameters do not include the length of the HCI ACL\n Data packet header or the HCI Synchronous Data packet header respectively.\n\n Event(s) generated (unless masked away):\n When the HCI_Host_Buffer_Size command has completed, an\n HCI_Command_Complete event shall be generated.\n\n * `p_params` - Input parameters.\n\n Returns 0 if success.\n Returns Returns value between 0x01-0xFF in case of error.\n         See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_host_buffer_size(p_params: *const sdc_hci_cmd_cb_host_buffer_size_t) -> u8;
}
extern "C" {
    #[doc = "  Host Number Of Completed Packets.\n\n The description below is extracted from Core_v5.4,\n Vol 4, Part E, Section 7.3.40\n\n The HCI_Host_Number_Of_Completed_Packets command is used by the\n Host to indicate to the Controller the number of HCI Data packets that have\n been completed for each Connection_Handle since the previous HCI_Host_-\n Number_Of_Completed_Packets command was sent to the Controller. This\n means that the corresponding buffer space has been freed in the Host and is\n available for new packets to be sent. Based on this information, and the\n Host_Total_Num_ACL_Data_Packets and Host_Total_Num_Synchronous_-\n Data_Packets command parameters of the HCI_Host_Buffer_Size command,\n the Controller can determine for which Connection_Handles the following HCI\n Data packets should be sent to the Host. When the Host has completed one or\n more HCI Data packet(s) it shall send an HCI_Host_Number_Of_Completed_-\n Packets command to the Controller, until it finally reports that all pending HCI\n Data packets have been completed. The frequency at which this command is\n sent is manufacturer specific.\n\n The Set Controller To Host Flow Control command is used to turn flow control on\n or off. If flow control from the Controller to the Host is turned on, the HCI_Host_-\n Buffer_Size command shall always be sent by the Host after a power-on or a\n reset before the first HCI_Host_Number_Of_Completed_Packets command is\n sent.\n\n The HCI_Host_Number_Of_Completed_Packets command may be sent at\n any time by the Host when there is at least one connection, or if the Controller\n is in local loopback mode, independent of other commands. If the Host issues\n this command when neither of these cases applies, the Controller shall ignore\n it.\n\n Event(s) generated (unless masked away):\n Normally, no event is generated after the HCI_Host_Number_Of_Completed_-\n Packets command has completed. However, if the HCI_Host_Number_Of_-\n Completed_Packets command contains one or more invalid parameters, the\n Controller shall return an HCI_Command_Complete event containing the error\n code Invalid HCI Command Parameters (0x12). The normal flow control for\n commands is not used for this command.\n\n * `p_params` - Input parameters.\n\n Returns 0 if success.\n Returns Returns value between 0x01-0xFF in case of error.\n         See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_host_number_of_completed_packets(
        p_params: *const sdc_hci_cmd_cb_host_number_of_completed_packets_t,
    ) -> u8;
}
extern "C" {
    #[doc = "  Set Event Mask Page 2.\n\n The description below is extracted from Core_v5.4,\n Vol 4, Part E, Section 7.3.69\n\n The HCI_Set_Event_Mask_Page_2 command is used to control which events\n are generated by the HCI for the Host. The Event_Mask_Page_2 is a logical\n extension to the Event_Mask parameter of the HCI_Set_Event_Mask\n command. If the bit in the Event_Mask_Page_2 is set to a one, then the event\n associated with that bit shall be enabled. The event mask allows the Host to\n control how much it is interrupted.\n\n The Controller shall ignore those bits which are reserved for future use or\n represent events which it does not support. If the Host sets any of these bits to\n 1, the Controller shall act as if they were set to 0.\n\n Event(s) generated (unless masked away):\n When the HCI_Set_Event_Mask_Page_2 command has completed, an\n HCI_Command_Complete event shall be generated.\n\n * `p_params` - Input parameters.\n\n Returns 0 if success.\n Returns Returns value between 0x01-0xFF in case of error.\n         See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_set_event_mask_page_2(p_params: *const sdc_hci_cmd_cb_set_event_mask_page_2_t) -> u8;
}
extern "C" {
    #[doc = "  Read Authenticated Payload Timeout.\n\n The description below is extracted from Core_v5.4,\n Vol 4, Part E, Section 7.3.93\n\n This command reads the Authenticated_Payload_Timeout\n (authenticatedPayloadTO, see [Vol 2] Part B, Appendix B for BR/EDR\n connections and [Vol 6] Part B, Section 5.4 for LE connections) parameter in\n the Controller on the specified Connection_Handle.\n\n When the Connection_Handle identifies a BR/EDR synchronous connection,\n the Controller shall return the error code Command Disallowed (0x0C).\n\n Event(s) generated (unless masked away):\n When the HCI_Read_Authenticated_Payload_Timeout command has\n completed, an HCI_Command_Complete event shall be generated.\n\n * `p_params` - Input parameters.\n * `p_return` - Extra return parameters.\n\n Returns 0 if success.\n Returns Returns value between 0x01-0xFF in case of error.\n         See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_read_authenticated_payload_timeout(
        p_params: *const sdc_hci_cmd_cb_read_authenticated_payload_timeout_t,
        p_return: *mut sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t,
    ) -> u8;
}
extern "C" {
    #[doc = "  Write Authenticated Payload Timeout.\n\n The description below is extracted from Core_v5.4,\n Vol 4, Part E, Section 7.3.94\n\n This command writes the Authenticated_Payload_Timeout\n (authenticatedPayloadTO, see [Vol 2] Part B, Appendix B and [Vol 6] Part B,\n Section 5.4 for the LE connection) parameter in the Controller for the specified\n Connection_Handle.\n\n When the Connection_Handle identifies a BR/EDR ACL connection:\n  If the connection is in Sniff mode, the Authenticated_Payload_Timeout shall\n   be equal to or greater than Tsniff.\n  If the connection is in Sniff Subrating mode, the\n   Authenticated_Payload_Timeout shall be equal to or greater than\n   (max subrate)xTsniff.\n  If the connection is in Hold mode, the Authenticated_Payload_Timeout shall\n   be equal to or greater than the holdTO value.\n\n When the Connection_Handle identifies a BR/EDR synchronous connection,\n this command shall be rejected with the error code Command Disallowed\n (0x0C).\n\n When the Connection_Handle identifies an LE connection, the\n Authenticated_Payload_Timeout shall be equal to or greater than\n connInterval  connSubrateFactor  (1 + connPeripheralLatency).\n\n When the Connection_Handle is associated with an ACL connection, the Link\n Manager will use this parameter to determine when to use the LMP ping\n sequence.\n\n When the Connection_Handle is associated with an LE connection, the Link\n Layer will use this parameter to determine when to use the LE ping sequence.\n\n Event(s) generated (unless masked away):\n When the HCI_Write_Authenticated_Payload_Timeout command has\n completed, an HCI_Command_Complete event shall be generated.\n\n * `p_params` - Input parameters.\n * `p_return` - Extra return parameters.\n\n Returns 0 if success.\n Returns Returns value between 0x01-0xFF in case of error.\n         See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_write_authenticated_payload_timeout(
        p_params: *const sdc_hci_cmd_cb_write_authenticated_payload_timeout_t,
        p_return: *mut sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t,
    ) -> u8;
}
#[doc = "  See @ref sdc_hci_cmd_ip_read_local_version_information()."]
pub const sdc_hci_opcode_ip_SDC_HCI_OPCODE_CMD_IP_READ_LOCAL_VERSION_INFORMATION: sdc_hci_opcode_ip = 4097;
#[doc = "  See @ref sdc_hci_cmd_ip_read_local_supported_commands()."]
pub const sdc_hci_opcode_ip_SDC_HCI_OPCODE_CMD_IP_READ_LOCAL_SUPPORTED_COMMANDS: sdc_hci_opcode_ip = 4098;
#[doc = "  See @ref sdc_hci_cmd_ip_read_local_supported_features()."]
pub const sdc_hci_opcode_ip_SDC_HCI_OPCODE_CMD_IP_READ_LOCAL_SUPPORTED_FEATURES: sdc_hci_opcode_ip = 4099;
#[doc = "  See @ref sdc_hci_cmd_ip_read_bd_addr()."]
pub const sdc_hci_opcode_ip_SDC_HCI_OPCODE_CMD_IP_READ_BD_ADDR: sdc_hci_opcode_ip = 4105;
#[doc = "  HCI IP OpCode Field values."]
pub type sdc_hci_opcode_ip = crate::ctypes::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_ip_lmp_features_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[test]
fn bindgen_test_layout_sdc_hci_ip_lmp_features_t() {
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_ip_lmp_features_t>(),
        8usize,
        concat!("Size of: ", stringify!(sdc_hci_ip_lmp_features_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_ip_lmp_features_t>(),
        1usize,
        concat!("Alignment of ", stringify!(sdc_hci_ip_lmp_features_t))
    );
}
impl sdc_hci_ip_lmp_features_t {
    #[inline]
    pub fn slot3_packets(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_slot3_packets(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn slot5_packets(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_slot5_packets(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn encryption(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_encryption(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn slot_offset(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_slot_offset(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn timing_accuracy(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_timing_accuracy(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn role_switch(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_role_switch(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hold_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hold_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn sniff_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sniff_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn power_control_requests(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_power_control_requests(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn cqddr(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_cqddr(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn sco_link(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sco_link(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hv2_packets(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hv2_packets(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hv3_packets(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hv3_packets(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn u_law_log_sync_data(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_u_law_log_sync_data(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn a_law_log_sync_data(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_a_law_log_sync_data(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn cvsd_sync_data(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_cvsd_sync_data(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn paging_param_negiotiation(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_paging_param_negiotiation(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn power_control(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_power_control(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn transparent_sync_data(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_transparent_sync_data(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn flow_control_lag(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_flow_control_lag(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn broadcast_encryption(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_broadcast_encryption(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enhanced_data_rate_acl_2mbps_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enhanced_data_rate_acl_2mbps_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enhanced_data_rate_acl_3mbps_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(26usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enhanced_data_rate_acl_3mbps_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(26usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enhanced_inquiry_scan(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enhanced_inquiry_scan(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn interlaced_inquiry_scan(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_interlaced_inquiry_scan(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn interlaced_page_scan(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_interlaced_page_scan(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rssi_with_inquiry_results(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rssi_with_inquiry_results(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ext_sco_link(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ext_sco_link(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ev4_packets(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(32usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ev4_packets(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(32usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ev5_packets(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(33usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ev5_packets(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(33usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(34usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(34usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn afh_capable_peripheral(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(35usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_afh_capable_peripheral(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(35usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn afh_classification_peripheral(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(36usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_afh_classification_peripheral(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(36usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bdedr_not_supported(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(37usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bdedr_not_supported(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(37usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn le_supported(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(38usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_le_supported(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(38usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn slot3_enhanced_data_rate(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(39usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_slot3_enhanced_data_rate(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(39usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn slot5_enhanced_data_rate(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(40usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_slot5_enhanced_data_rate(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(40usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn sniff_subrating(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(41usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sniff_subrating(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(41usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pause_encryption(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(42usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pause_encryption(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(42usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn afh_capable_central(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(43usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_afh_capable_central(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(43usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn afh_classification_central(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(44usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_afh_classification_central(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(44usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enhanced_data_rate_esco_2mbps_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(45usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enhanced_data_rate_esco_2mbps_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(45usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enhanced_data_rate_esco_3mbps_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(46usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enhanced_data_rate_esco_3mbps_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(46usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn slot3_enhanced_data_rate_esco(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(47usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_slot3_enhanced_data_rate_esco(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(47usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ext_inquiry_response(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(48usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ext_inquiry_response(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(48usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn simultanious_le_and_bdedr(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(49usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_simultanious_le_and_bdedr(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(49usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(50usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(50usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn secure_simple_pairing(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(51usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_secure_simple_pairing(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(51usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn encapsulated_pdu(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(52usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_encapsulated_pdu(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(52usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn errorneous_data_reporting(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(53usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_errorneous_data_reporting(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(53usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn non_flushable_packet_boundary(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(54usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_non_flushable_packet_boundary(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(54usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(55usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(55usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_link_supervision_timeout_changed_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(56usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_link_supervision_timeout_changed_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(56usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn variable_inquiry_tx_power_level(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(57usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_variable_inquiry_tx_power_level(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(57usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enhanced_power_control(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(58usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enhanced_power_control(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(58usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu5(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(59usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu5(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(59usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(60usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(60usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(61usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(61usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu8(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(62usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu8(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(62usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ext_features(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(63usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ext_features(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(63usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        slot3_packets: u8,
        slot5_packets: u8,
        encryption: u8,
        slot_offset: u8,
        timing_accuracy: u8,
        role_switch: u8,
        hold_mode: u8,
        sniff_mode: u8,
        previously_used: u8,
        power_control_requests: u8,
        cqddr: u8,
        sco_link: u8,
        hv2_packets: u8,
        hv3_packets: u8,
        u_law_log_sync_data: u8,
        a_law_log_sync_data: u8,
        cvsd_sync_data: u8,
        paging_param_negiotiation: u8,
        power_control: u8,
        transparent_sync_data: u8,
        flow_control_lag: u8,
        broadcast_encryption: u8,
        rfu1: u8,
        enhanced_data_rate_acl_2mbps_mode: u8,
        enhanced_data_rate_acl_3mbps_mode: u8,
        enhanced_inquiry_scan: u8,
        interlaced_inquiry_scan: u8,
        interlaced_page_scan: u8,
        rssi_with_inquiry_results: u8,
        ext_sco_link: u8,
        ev4_packets: u8,
        ev5_packets: u8,
        rfu2: u8,
        afh_capable_peripheral: u8,
        afh_classification_peripheral: u8,
        bdedr_not_supported: u8,
        le_supported: u8,
        slot3_enhanced_data_rate: u8,
        slot5_enhanced_data_rate: u8,
        sniff_subrating: u8,
        pause_encryption: u8,
        afh_capable_central: u8,
        afh_classification_central: u8,
        enhanced_data_rate_esco_2mbps_mode: u8,
        enhanced_data_rate_esco_3mbps_mode: u8,
        slot3_enhanced_data_rate_esco: u8,
        ext_inquiry_response: u8,
        simultanious_le_and_bdedr: u8,
        rfu3: u8,
        secure_simple_pairing: u8,
        encapsulated_pdu: u8,
        errorneous_data_reporting: u8,
        non_flushable_packet_boundary: u8,
        rfu4: u8,
        hci_link_supervision_timeout_changed_event: u8,
        variable_inquiry_tx_power_level: u8,
        enhanced_power_control: u8,
        rfu5: u8,
        rfu6: u8,
        rfu7: u8,
        rfu8: u8,
        ext_features: u8,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let slot3_packets: u8 = unsafe { ::core::mem::transmute(slot3_packets) };
            slot3_packets as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let slot5_packets: u8 = unsafe { ::core::mem::transmute(slot5_packets) };
            slot5_packets as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let encryption: u8 = unsafe { ::core::mem::transmute(encryption) };
            encryption as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let slot_offset: u8 = unsafe { ::core::mem::transmute(slot_offset) };
            slot_offset as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let timing_accuracy: u8 = unsafe { ::core::mem::transmute(timing_accuracy) };
            timing_accuracy as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let role_switch: u8 = unsafe { ::core::mem::transmute(role_switch) };
            role_switch as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let hold_mode: u8 = unsafe { ::core::mem::transmute(hold_mode) };
            hold_mode as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let sniff_mode: u8 = unsafe { ::core::mem::transmute(sniff_mode) };
            sniff_mode as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let previously_used: u8 = unsafe { ::core::mem::transmute(previously_used) };
            previously_used as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let power_control_requests: u8 = unsafe { ::core::mem::transmute(power_control_requests) };
            power_control_requests as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let cqddr: u8 = unsafe { ::core::mem::transmute(cqddr) };
            cqddr as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let sco_link: u8 = unsafe { ::core::mem::transmute(sco_link) };
            sco_link as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let hv2_packets: u8 = unsafe { ::core::mem::transmute(hv2_packets) };
            hv2_packets as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let hv3_packets: u8 = unsafe { ::core::mem::transmute(hv3_packets) };
            hv3_packets as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let u_law_log_sync_data: u8 = unsafe { ::core::mem::transmute(u_law_log_sync_data) };
            u_law_log_sync_data as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let a_law_log_sync_data: u8 = unsafe { ::core::mem::transmute(a_law_log_sync_data) };
            a_law_log_sync_data as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let cvsd_sync_data: u8 = unsafe { ::core::mem::transmute(cvsd_sync_data) };
            cvsd_sync_data as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let paging_param_negiotiation: u8 = unsafe { ::core::mem::transmute(paging_param_negiotiation) };
            paging_param_negiotiation as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let power_control: u8 = unsafe { ::core::mem::transmute(power_control) };
            power_control as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let transparent_sync_data: u8 = unsafe { ::core::mem::transmute(transparent_sync_data) };
            transparent_sync_data as u64
        });
        __bindgen_bitfield_unit.set(20usize, 3u8, {
            let flow_control_lag: u8 = unsafe { ::core::mem::transmute(flow_control_lag) };
            flow_control_lag as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let broadcast_encryption: u8 = unsafe { ::core::mem::transmute(broadcast_encryption) };
            broadcast_encryption as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let rfu1: u8 = unsafe { ::core::mem::transmute(rfu1) };
            rfu1 as u64
        });
        __bindgen_bitfield_unit.set(25usize, 1u8, {
            let enhanced_data_rate_acl_2mbps_mode: u8 =
                unsafe { ::core::mem::transmute(enhanced_data_rate_acl_2mbps_mode) };
            enhanced_data_rate_acl_2mbps_mode as u64
        });
        __bindgen_bitfield_unit.set(26usize, 1u8, {
            let enhanced_data_rate_acl_3mbps_mode: u8 =
                unsafe { ::core::mem::transmute(enhanced_data_rate_acl_3mbps_mode) };
            enhanced_data_rate_acl_3mbps_mode as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let enhanced_inquiry_scan: u8 = unsafe { ::core::mem::transmute(enhanced_inquiry_scan) };
            enhanced_inquiry_scan as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let interlaced_inquiry_scan: u8 = unsafe { ::core::mem::transmute(interlaced_inquiry_scan) };
            interlaced_inquiry_scan as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let interlaced_page_scan: u8 = unsafe { ::core::mem::transmute(interlaced_page_scan) };
            interlaced_page_scan as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let rssi_with_inquiry_results: u8 = unsafe { ::core::mem::transmute(rssi_with_inquiry_results) };
            rssi_with_inquiry_results as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let ext_sco_link: u8 = unsafe { ::core::mem::transmute(ext_sco_link) };
            ext_sco_link as u64
        });
        __bindgen_bitfield_unit.set(32usize, 1u8, {
            let ev4_packets: u8 = unsafe { ::core::mem::transmute(ev4_packets) };
            ev4_packets as u64
        });
        __bindgen_bitfield_unit.set(33usize, 1u8, {
            let ev5_packets: u8 = unsafe { ::core::mem::transmute(ev5_packets) };
            ev5_packets as u64
        });
        __bindgen_bitfield_unit.set(34usize, 1u8, {
            let rfu2: u8 = unsafe { ::core::mem::transmute(rfu2) };
            rfu2 as u64
        });
        __bindgen_bitfield_unit.set(35usize, 1u8, {
            let afh_capable_peripheral: u8 = unsafe { ::core::mem::transmute(afh_capable_peripheral) };
            afh_capable_peripheral as u64
        });
        __bindgen_bitfield_unit.set(36usize, 1u8, {
            let afh_classification_peripheral: u8 = unsafe { ::core::mem::transmute(afh_classification_peripheral) };
            afh_classification_peripheral as u64
        });
        __bindgen_bitfield_unit.set(37usize, 1u8, {
            let bdedr_not_supported: u8 = unsafe { ::core::mem::transmute(bdedr_not_supported) };
            bdedr_not_supported as u64
        });
        __bindgen_bitfield_unit.set(38usize, 1u8, {
            let le_supported: u8 = unsafe { ::core::mem::transmute(le_supported) };
            le_supported as u64
        });
        __bindgen_bitfield_unit.set(39usize, 1u8, {
            let slot3_enhanced_data_rate: u8 = unsafe { ::core::mem::transmute(slot3_enhanced_data_rate) };
            slot3_enhanced_data_rate as u64
        });
        __bindgen_bitfield_unit.set(40usize, 1u8, {
            let slot5_enhanced_data_rate: u8 = unsafe { ::core::mem::transmute(slot5_enhanced_data_rate) };
            slot5_enhanced_data_rate as u64
        });
        __bindgen_bitfield_unit.set(41usize, 1u8, {
            let sniff_subrating: u8 = unsafe { ::core::mem::transmute(sniff_subrating) };
            sniff_subrating as u64
        });
        __bindgen_bitfield_unit.set(42usize, 1u8, {
            let pause_encryption: u8 = unsafe { ::core::mem::transmute(pause_encryption) };
            pause_encryption as u64
        });
        __bindgen_bitfield_unit.set(43usize, 1u8, {
            let afh_capable_central: u8 = unsafe { ::core::mem::transmute(afh_capable_central) };
            afh_capable_central as u64
        });
        __bindgen_bitfield_unit.set(44usize, 1u8, {
            let afh_classification_central: u8 = unsafe { ::core::mem::transmute(afh_classification_central) };
            afh_classification_central as u64
        });
        __bindgen_bitfield_unit.set(45usize, 1u8, {
            let enhanced_data_rate_esco_2mbps_mode: u8 =
                unsafe { ::core::mem::transmute(enhanced_data_rate_esco_2mbps_mode) };
            enhanced_data_rate_esco_2mbps_mode as u64
        });
        __bindgen_bitfield_unit.set(46usize, 1u8, {
            let enhanced_data_rate_esco_3mbps_mode: u8 =
                unsafe { ::core::mem::transmute(enhanced_data_rate_esco_3mbps_mode) };
            enhanced_data_rate_esco_3mbps_mode as u64
        });
        __bindgen_bitfield_unit.set(47usize, 1u8, {
            let slot3_enhanced_data_rate_esco: u8 = unsafe { ::core::mem::transmute(slot3_enhanced_data_rate_esco) };
            slot3_enhanced_data_rate_esco as u64
        });
        __bindgen_bitfield_unit.set(48usize, 1u8, {
            let ext_inquiry_response: u8 = unsafe { ::core::mem::transmute(ext_inquiry_response) };
            ext_inquiry_response as u64
        });
        __bindgen_bitfield_unit.set(49usize, 1u8, {
            let simultanious_le_and_bdedr: u8 = unsafe { ::core::mem::transmute(simultanious_le_and_bdedr) };
            simultanious_le_and_bdedr as u64
        });
        __bindgen_bitfield_unit.set(50usize, 1u8, {
            let rfu3: u8 = unsafe { ::core::mem::transmute(rfu3) };
            rfu3 as u64
        });
        __bindgen_bitfield_unit.set(51usize, 1u8, {
            let secure_simple_pairing: u8 = unsafe { ::core::mem::transmute(secure_simple_pairing) };
            secure_simple_pairing as u64
        });
        __bindgen_bitfield_unit.set(52usize, 1u8, {
            let encapsulated_pdu: u8 = unsafe { ::core::mem::transmute(encapsulated_pdu) };
            encapsulated_pdu as u64
        });
        __bindgen_bitfield_unit.set(53usize, 1u8, {
            let errorneous_data_reporting: u8 = unsafe { ::core::mem::transmute(errorneous_data_reporting) };
            errorneous_data_reporting as u64
        });
        __bindgen_bitfield_unit.set(54usize, 1u8, {
            let non_flushable_packet_boundary: u8 = unsafe { ::core::mem::transmute(non_flushable_packet_boundary) };
            non_flushable_packet_boundary as u64
        });
        __bindgen_bitfield_unit.set(55usize, 1u8, {
            let rfu4: u8 = unsafe { ::core::mem::transmute(rfu4) };
            rfu4 as u64
        });
        __bindgen_bitfield_unit.set(56usize, 1u8, {
            let hci_link_supervision_timeout_changed_event: u8 =
                unsafe { ::core::mem::transmute(hci_link_supervision_timeout_changed_event) };
            hci_link_supervision_timeout_changed_event as u64
        });
        __bindgen_bitfield_unit.set(57usize, 1u8, {
            let variable_inquiry_tx_power_level: u8 =
                unsafe { ::core::mem::transmute(variable_inquiry_tx_power_level) };
            variable_inquiry_tx_power_level as u64
        });
        __bindgen_bitfield_unit.set(58usize, 1u8, {
            let enhanced_power_control: u8 = unsafe { ::core::mem::transmute(enhanced_power_control) };
            enhanced_power_control as u64
        });
        __bindgen_bitfield_unit.set(59usize, 1u8, {
            let rfu5: u8 = unsafe { ::core::mem::transmute(rfu5) };
            rfu5 as u64
        });
        __bindgen_bitfield_unit.set(60usize, 1u8, {
            let rfu6: u8 = unsafe { ::core::mem::transmute(rfu6) };
            rfu6 as u64
        });
        __bindgen_bitfield_unit.set(61usize, 1u8, {
            let rfu7: u8 = unsafe { ::core::mem::transmute(rfu7) };
            rfu7 as u64
        });
        __bindgen_bitfield_unit.set(62usize, 1u8, {
            let rfu8: u8 = unsafe { ::core::mem::transmute(rfu8) };
            rfu8 as u64
        });
        __bindgen_bitfield_unit.set(63usize, 1u8, {
            let ext_features: u8 = unsafe { ::core::mem::transmute(ext_features) };
            ext_features as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_ip_supported_commands_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 48usize]>,
}
#[test]
fn bindgen_test_layout_sdc_hci_ip_supported_commands_t() {
    assert_eq!(
        ::core::mem::size_of::<sdc_hci_ip_supported_commands_t>(),
        48usize,
        concat!("Size of: ", stringify!(sdc_hci_ip_supported_commands_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sdc_hci_ip_supported_commands_t>(),
        1usize,
        concat!("Alignment of ", stringify!(sdc_hci_ip_supported_commands_t))
    );
}
impl sdc_hci_ip_supported_commands_t {
    #[inline]
    pub fn hci_inquiry(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_inquiry(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_inquiry_cancel(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_inquiry_cancel(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_periodic_inquiry_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_periodic_inquiry_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_exit_periodic_inquiry_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_exit_periodic_inquiry_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_create_connection(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_create_connection(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_disconnect(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_disconnect(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_0_6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_0_6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_create_connection_cancel(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_create_connection_cancel(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_accept_connection_request(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_accept_connection_request(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_reject_connection_request(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_reject_connection_request(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_link_key_request_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_link_key_request_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_link_key_request_negative_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_link_key_request_negative_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_pin_code_request_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_pin_code_request_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_pin_code_request_negative_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_pin_code_request_negative_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_change_connection_packet_type(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_change_connection_packet_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_authentication_requested(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_authentication_requested(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_connection_encryption(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_connection_encryption(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_change_connection_link_key(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_change_connection_link_key(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_link_key_selection(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_link_key_selection(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_remote_name_request(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_remote_name_request(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_remote_name_request_cancel(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_remote_name_request_cancel(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_remote_supported_features(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_remote_supported_features(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_remote_extended_features(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_remote_extended_features(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_remote_version_information(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_remote_version_information(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_clock_offset(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_clock_offset(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_lmp_handle(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_lmp_handle(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_3_2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(26usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_3_2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(26usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_3_3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_3_3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_3_4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_3_4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_3_5(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_3_5(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_3_6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_3_6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_3_7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_3_7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_4_0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(32usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_4_0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(32usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_hold_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(33usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_hold_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(33usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_sniff_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(34usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_sniff_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(34usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_exit_sniff_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(35usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_exit_sniff_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(35usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_4_4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(36usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_4_4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(36usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_4_5(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(37usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_4_5(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(37usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_qos_setup(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(38usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_qos_setup(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(38usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_role_discovery(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(39usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_role_discovery(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(39usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_switch_role(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(40usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_switch_role(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(40usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_link_policy_settings(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(41usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_link_policy_settings(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(41usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_link_policy_settings(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(42usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_link_policy_settings(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(42usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_default_link_policy_settings(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(43usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_default_link_policy_settings(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(43usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_default_link_policy_settings(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(44usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_default_link_policy_settings(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(44usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_flow_specification(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(45usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_flow_specification(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(45usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_event_mask(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(46usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_event_mask(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(46usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_reset(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(47usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_reset(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(47usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_event_filter(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(48usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_event_filter(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(48usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_flush(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(49usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_flush(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(49usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_pin_type(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(50usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_pin_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(50usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_pin_type(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(51usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_pin_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(51usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_6_4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(52usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_6_4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(52usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_stored_link_key(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(53usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_stored_link_key(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(53usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_stored_link_key(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(54usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_stored_link_key(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(54usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_delete_stored_link_key(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(55usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_delete_stored_link_key(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(55usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_local_name(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(56usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_local_name(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(56usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_local_name(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(57usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_local_name(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(57usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_connection_accept_timeout(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(58usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_connection_accept_timeout(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(58usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_connection_accept_timeout(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(59usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_connection_accept_timeout(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(59usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_page_timeout(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(60usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_page_timeout(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(60usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_page_timeout(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(61usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_page_timeout(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(61usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_scan_enable(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(62usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_scan_enable(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(62usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_scan_enable(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(63usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_scan_enable(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(63usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_page_scan_activity(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(64usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_page_scan_activity(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(64usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_page_scan_activity(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(65usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_page_scan_activity(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(65usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_inquiry_scan_activity(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(66usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_inquiry_scan_activity(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(66usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_inquiry_scan_activity(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(67usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_inquiry_scan_activity(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(67usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_authentication_enable(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(68usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_authentication_enable(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(68usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_authentication_enable(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(69usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_authentication_enable(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(69usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_8_6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(70usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_8_6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(70usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_8_7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(71usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_8_7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(71usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_class_of_device(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(72usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_class_of_device(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(72usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_class_of_device(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(73usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_class_of_device(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(73usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_voice_setting(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(74usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_voice_setting(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(74usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_voice_setting(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(75usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_voice_setting(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(75usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_automatic_flush_timeout(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(76usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_automatic_flush_timeout(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(76usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_automatic_flush_timeout(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(77usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_automatic_flush_timeout(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(77usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_num_broadcast_retransmissions(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(78usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_num_broadcast_retransmissions(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(78usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_num_broadcast_retransmissions(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(79usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_num_broadcast_retransmissions(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(79usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_hold_mode_activity(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(80usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_hold_mode_activity(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(80usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_hold_mode_activity(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(81usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_hold_mode_activity(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(81usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_transmit_power_level(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(82usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_transmit_power_level(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(82usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_synchronous_flow_control_enable(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(83usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_synchronous_flow_control_enable(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(83usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_synchronous_flow_control_enable(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(84usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_synchronous_flow_control_enable(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(84usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_controller_to_host_flow_control(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(85usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_controller_to_host_flow_control(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(85usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_host_buffer_size(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(86usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_host_buffer_size(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(86usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_host_number_of_completed_packets(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(87usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_host_number_of_completed_packets(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(87usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_link_supervision_timeout(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(88usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_link_supervision_timeout(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(88usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_link_supervision_timeout(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(89usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_link_supervision_timeout(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(89usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_number_of_supported_iac(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(90usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_number_of_supported_iac(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(90usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_current_iac_lap(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(91usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_current_iac_lap(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(91usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_current_iac_lap(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(92usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_current_iac_lap(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(92usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_11_5(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(93usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_11_5(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(93usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_11_6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(94usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_11_6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(94usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_11_7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(95usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_11_7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(95usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_12_0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(96usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_12_0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(96usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_afh_host_channel_classification(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(97usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_afh_host_channel_classification(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(97usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_12_2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(98usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_12_2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(98usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_12_3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(99usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_12_3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(99usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_inquiry_scan_type(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(100usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_inquiry_scan_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(100usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_inquiry_scan_type(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(101usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_inquiry_scan_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(101usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_inquiry_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(102usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_inquiry_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(102usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_inquiry_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(103usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_inquiry_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(103usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_page_scan_type(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(104usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_page_scan_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(104usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_page_scan_type(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(105usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_page_scan_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(105usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_afh_channel_assessment_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(106usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_afh_channel_assessment_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(106usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_afh_channel_assessment_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(107usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_afh_channel_assessment_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(107usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_13_4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(108usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_13_4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(108usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_13_5(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(109usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_13_5(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(109usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_13_6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(110usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_13_6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(110usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_13_7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(111usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_13_7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(111usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_14_0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(112usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_14_0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(112usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_14_1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(113usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_14_1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(113usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_14_2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(114usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_14_2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(114usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_local_version_information(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(115usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_local_version_information(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(115usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_14_4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(116usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_14_4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(116usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_local_supported_features(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(117usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_local_supported_features(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(117usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_local_extended_features(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(118usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_local_extended_features(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(118usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_buffer_size(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(119usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_buffer_size(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(119usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_15_0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(120usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_15_0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(120usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_bd_addr(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(121usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_bd_addr(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(121usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_failed_contact_counter(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(122usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_failed_contact_counter(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(122usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_reset_failed_contact_counter(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(123usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_reset_failed_contact_counter(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(123usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_link_quality(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(124usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_link_quality(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(124usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_rssi(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(125usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_rssi(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(125usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_afh_channel_map(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(126usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_afh_channel_map(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(126usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_clock(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(127usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_clock(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(127usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_loopback_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(128usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_loopback_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(128usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_loopback_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(129usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_loopback_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(129usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_enable_device_under_test_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(130usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_enable_device_under_test_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(130usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_setup_synchronous_connection_request(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(131usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_setup_synchronous_connection_request(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(131usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_accept_synchronous_connection_request(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(132usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_accept_synchronous_connection_request(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(132usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_reject_synchronous_connection_request(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(133usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_reject_synchronous_connection_request(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(133usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_16_6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(134usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_16_6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(134usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_16_7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(135usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_16_7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(135usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_extended_inquiry_response(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(136usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_extended_inquiry_response(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(136usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_extended_inquiry_response(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(137usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_extended_inquiry_response(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(137usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_refresh_encryption_key(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(138usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_refresh_encryption_key(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(138usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_17_3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(139usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_17_3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(139usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_sniff_subrating(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(140usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_sniff_subrating(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(140usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_simple_pairing_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(141usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_simple_pairing_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(141usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_simple_pairing_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(142usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_simple_pairing_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(142usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_local_oob_data(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(143usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_local_oob_data(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(143usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_inquiry_response_transmit_power_level(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(144usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_inquiry_response_transmit_power_level(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(144usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_inquiry_transmit_power_level(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(145usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_inquiry_transmit_power_level(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(145usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_default_erroneous_data_reporting(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(146usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_default_erroneous_data_reporting(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(146usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_default_erroneous_data_reporting(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(147usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_default_erroneous_data_reporting(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(147usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_18_4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(148usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_18_4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(148usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_18_5(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(149usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_18_5(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(149usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_18_6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(150usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_18_6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(150usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_io_capability_request_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(151usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_io_capability_request_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(151usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_user_confirmation_request_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(152usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_user_confirmation_request_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(152usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_user_confirmation_request_negative_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(153usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_user_confirmation_request_negative_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(153usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_user_passkey_request_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(154usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_user_passkey_request_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(154usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_user_passkey_request_negative_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(155usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_user_passkey_request_negative_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(155usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_remote_oob_data_request_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(156usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_remote_oob_data_request_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(156usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_simple_pairing_debug_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(157usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_simple_pairing_debug_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(157usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_enhanced_flush(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(158usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_enhanced_flush(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(158usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_remote_oob_data_request_negative_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(159usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_remote_oob_data_request_negative_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(159usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_20_0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(160usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_20_0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(160usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_20_1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(161usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_20_1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(161usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_send_keypress_notification(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(162usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_send_keypress_notification(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(162usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_io_capability_request_negative_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(163usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_io_capability_request_negative_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(163usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_encryption_key_size(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(164usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_encryption_key_size(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(164usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_20_5(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(165usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_20_5(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(165usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_20_6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(166usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_20_6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(166usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_20_7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(167usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_20_7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(167usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_21_0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(168usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_21_0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(168usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_21_1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(169usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_21_1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(169usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_21_2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(170usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_21_2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(170usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_21_3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(171usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_21_3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(171usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_21_4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(172usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_21_4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(172usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_21_5(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(173usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_21_5(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(173usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_21_6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(174usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_21_6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(174usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_21_7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(175usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_21_7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(175usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_22_0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(176usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_22_0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(176usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_22_1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(177usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_22_1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(177usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_event_mask_page_2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(178usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_event_mask_page_2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(178usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_22_3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(179usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_22_3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(179usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_22_4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(180usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_22_4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(180usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_22_5(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(181usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_22_5(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(181usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_22_6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(182usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_22_6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(182usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_22_7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(183usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_22_7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(183usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_flow_control_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(184usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_flow_control_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(184usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_flow_control_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(185usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_flow_control_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(185usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_data_block_size(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(186usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_data_block_size(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(186usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_23_3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(187usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_23_3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(187usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_23_4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(188usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_23_4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(188usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_23_5(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(189usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_23_5(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(189usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_23_6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(190usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_23_6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(190usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_23_7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(191usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_23_7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(191usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_enhanced_transmit_power_level(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(192usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_enhanced_transmit_power_level(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(192usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_24_1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(193usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_24_1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(193usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_24_2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(194usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_24_2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(194usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_24_3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(195usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_24_3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(195usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn previously_used_24_4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(196usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_24_4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(196usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_le_host_support(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(197usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_le_host_support(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(197usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_le_host_support(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(198usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_le_host_support(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(198usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_24_7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(199usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_24_7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(199usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_event_mask(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(200usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_event_mask(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(200usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_buffer_size_v1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(201usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_buffer_size_v1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(201usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_local_supported_features(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(202usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_local_supported_features(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(202usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_25_3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(203usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_25_3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(203usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_random_address(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(204usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_random_address(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(204usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_advertising_parameters(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(205usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_advertising_parameters(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(205usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_advertising_physical_channel_tx_power(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(206usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_advertising_physical_channel_tx_power(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(206usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_advertising_data(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(207usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_advertising_data(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(207usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_scan_response_data(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(208usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_scan_response_data(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(208usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_advertising_enable(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(209usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_advertising_enable(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(209usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_scan_parameters(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(210usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_scan_parameters(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(210usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_scan_enable(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(211usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_scan_enable(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(211usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_create_connection(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(212usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_create_connection(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(212usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_create_connection_cancel(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(213usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_create_connection_cancel(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(213usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_filter_accept_list_size(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(214usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_filter_accept_list_size(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(214usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_clear_filter_accept_list(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(215usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_clear_filter_accept_list(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(215usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_add_device_to_filter_accept_list(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(216usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_add_device_to_filter_accept_list(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(216usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_remove_device_from_filter_accept_list(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(217usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_remove_device_from_filter_accept_list(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(217usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_connection_update(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(218usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_connection_update(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(218usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_host_channel_classification(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(219usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_host_channel_classification(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(219usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_channel_map(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(220usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_channel_map(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(220usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_remote_features(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(221usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_remote_features(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(221usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_encrypt(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(222usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_encrypt(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(222usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_rand(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(223usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_rand(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(223usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_enable_encryption(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(224usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_enable_encryption(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(224usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_long_term_key_request_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(225usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_long_term_key_request_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(225usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_long_term_key_request_negative_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(226usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_long_term_key_request_negative_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(226usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_supported_states(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(227usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_supported_states(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(227usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_receiver_test_v1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(228usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_receiver_test_v1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(228usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_transmitter_test_v1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(229usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_transmitter_test_v1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(229usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_test_end(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(230usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_test_end(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(230usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_28_7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(231usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_28_7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(231usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_29_0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(232usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_29_0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(232usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_29_1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(233usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_29_1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(233usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rfu_29_2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(234usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu_29_2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(234usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_enhanced_setup_synchronous_connection(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(235usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_enhanced_setup_synchronous_connection(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(235usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_enhanced_accept_synchronous_connection(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(236usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_enhanced_accept_synchronous_connection(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(236usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_local_supported_codecs(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(237usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_local_supported_codecs(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(237usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_mws_channel_parameters(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(238usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_mws_channel_parameters(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(238usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_external_frame_configuration(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(239usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_external_frame_configuration(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(239usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_mws_signaling(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(240usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_mws_signaling(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(240usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_mws_transport_layer(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(241usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_mws_transport_layer(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(241usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_mws_scan_frequency_table(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(242usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_mws_scan_frequency_table(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(242usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_get_mws_transport_layer_configuration(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(243usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_get_mws_transport_layer_configuration(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(243usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_mws_pattern_configuration(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(244usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_mws_pattern_configuration(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(244usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_triggered_clock_capture(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(245usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_triggered_clock_capture(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(245usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_truncated_page(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(246usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_truncated_page(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(246usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_truncated_page_cancel(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(247usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_truncated_page_cancel(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(247usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_connectionless_peripheral_broadcast(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(248usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_connectionless_peripheral_broadcast(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(248usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_connectionless_peripheral_broadcast_receive(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(249usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_connectionless_peripheral_broadcast_receive(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(249usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_start_synchronization_train(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(250usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_start_synchronization_train(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(250usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_receive_synchronization_train(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(251usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_receive_synchronization_train(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(251usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_reserved_lt_addr(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(252usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_reserved_lt_addr(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(252usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_delete_reserved_lt_addr(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(253usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_delete_reserved_lt_addr(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(253usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_set_connectionless_peripheral_broadcast_data(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(254usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_connectionless_peripheral_broadcast_data(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(254usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_synchronization_train_parameters(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(255usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_synchronization_train_parameters(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(255usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_synchronization_train_parameters(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(256usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_synchronization_train_parameters(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(256usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_remote_oob_extended_data_request_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(257usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_remote_oob_extended_data_request_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(257usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_secure_connections_host_support(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(258usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_secure_connections_host_support(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(258usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_secure_connections_host_support(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(259usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_secure_connections_host_support(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(259usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_authenticated_payload_timeout(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(260usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_authenticated_payload_timeout(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(260usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_authenticated_payload_timeout(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(261usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_authenticated_payload_timeout(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(261usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_local_oob_extended_data(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(262usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_local_oob_extended_data(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(262usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_secure_connections_test_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(263usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_secure_connections_test_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(263usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_extended_page_timeout(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(264usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_extended_page_timeout(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(264usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_extended_page_timeout(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(265usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_extended_page_timeout(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(265usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_read_extended_inquiry_length(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(266usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_read_extended_inquiry_length(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(266usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_write_extended_inquiry_length(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(267usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_write_extended_inquiry_length(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(267usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_remote_connection_parameter_request_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(268usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_remote_connection_parameter_request_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(268usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_remote_connection_parameter_request_negative_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(269usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_remote_connection_parameter_request_negative_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(269usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_data_length(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(270usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_data_length(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(270usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_suggested_default_data_length(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(271usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_suggested_default_data_length(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(271usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_write_suggested_default_data_length(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(272usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_write_suggested_default_data_length(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(272usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_local_p256_public_key(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(273usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_local_p256_public_key(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(273usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_generate_dhkey_v1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(274usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_generate_dhkey_v1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(274usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_add_device_to_resolving_list(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(275usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_add_device_to_resolving_list(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(275usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_remove_device_from_resolving_list(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(276usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_remove_device_from_resolving_list(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(276usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_clear_resolving_list(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(277usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_clear_resolving_list(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(277usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_resolving_list_size(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(278usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_resolving_list_size(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(278usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_peer_resolvable_address(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(279usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_peer_resolvable_address(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(279usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_local_resolvable_address(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(280usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_local_resolvable_address(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(280usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_address_resolution_enable(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(281usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_address_resolution_enable(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(281usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_resolvable_private_address_timeout(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(282usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_resolvable_private_address_timeout(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(282usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_maximum_data_length(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(283usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_maximum_data_length(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(283usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_phy(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(284usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_phy(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(284usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_default_phy(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(285usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_default_phy(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(285usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_phy(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(286usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_phy(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(286usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_receiver_test_v2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(287usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_receiver_test_v2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(287usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_transmitter_test_v2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(288usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_transmitter_test_v2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(288usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_advertising_set_random_address(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(289usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_advertising_set_random_address(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(289usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_extended_advertising_parameters(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(290usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_extended_advertising_parameters(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(290usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_extended_advertising_data(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(291usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_extended_advertising_data(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(291usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_extended_scan_response_data(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(292usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_extended_scan_response_data(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(292usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_set_extended_advertising_enable(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(293usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_set_extended_advertising_enable(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(293usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_maximum_advertising_data_length(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(294usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_maximum_advertising_data_length(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(294usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hci_le_read_number_of_supported_advertising_sets(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(295usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_le_read_number_of_supported_advertising_sets(&mut self, val: u8) {
        unsafe {
